import React from 'react';
import { View, Text, Image, ScrollView, FlatList } from 'react-native';
import { FontAwesome } from '@expo/vector-icons';
import { createMaterialTopTabNavigator } from '@react-navigation/material-top-tabs';

const Tab = createMaterialTopTabNavigator();

export default function AllOfUsAreDeadTab() {

    return (
        <Tab.Navigator screenOptions={{ tabBarActiveTintColor: "tomato", tabBarInactiveTintColor: "gray", }} >
            <Tab.Screen
                name="FlashScreen"
                component={FlashScreen}
                options={{
                    tabBarLabel: "Short Story",
                    headerShown: false
                }}
            />
            <Tab.Screen
                name="FlameScreen"
                component={FlameScreen}
                options={{
                    tabBarLabel: "Characters",
                    headerShown: false
                }}
            />
            <Tab.Screen
                name="LeafScreen"
                component={LeafScreen}
                options={{
                    tabBarLabel: "Others",
                    headerShown: false
                }}
            />

        </Tab.Navigator>


    );

}
function FlashScreen() {
    return (
        <ScrollView contentContainerStyle={{ flexGrow: 1, alignItems: 'center' }}>
            <View style={{ flex: 1, alignItems: 'center' }}>
                <Image
                    source={{ uri: "https://i.pinimg.com/564x/7f/8c/6e/7f8c6e81d9c6f928e3b1f0d15b44c188.jpg" }}
                    style={{ width: 450, height: 280 }}
                />
                <View style={{ flexDirection: 'row', margin: 8 }}>
                    <Image
                        source={{ uri: "https://wonderroanne.files.wordpress.com/2022/02/all-of-us-are-dead-spreading-fast.gif.webp" }}
                        style={{ width: 220, height: 160, marginRight: 5 }}
                    />
                    <Image
                        source={{ uri: "https://thegioidienanh.vn/stores/news_dataimages/yenlinh/022022/07/12/1639_all-of-us-are-dead-060222-2.gif?rt=20220207121926" }}
                        style={{ width: 210, height: 160, marginLeft: 5 }}
                    />

                </View>

                <Text style={{ fontSize: 30, paddingTop: 20 }}>All Of US Are Dead </Text>
                <Text style={{ fontSize: 17, padding: 10, color: '#828282' }}>   หลังจากความล้มเหลวของการวิจัยทางวิทยาศาสตร์ โรงเรียนมัธยมปลายท้องถิ่นเต็มไปด้วยซอมบี การต่อสู้สุดตึงเครียดระหว่างนักเรียนที่กลายเป็นฝูงซอมบี้กับบรรดาผู้รอดชีวิตที่ดิ้นรนหนีตาย โดยกลุ่มนักเรียนที่รอดชีวิตต่างพยายามหาทางเอาตัวรอดจากเหตุการณ์นี้ โดยไม่มีโทรศัพท์ ไม่มีอาหาร และไม่มีใครเหลียวแล พวกเขาต้องใช้สิ่งของและอุปกรณ์รอบตัวในโรงเรียน ไม่ว่าจะเป็น โคมไฟ ชั้นหนังสือ แม้กระทั่ง คันธนู เพื่อปกป้องตนเองจากฝูงซอมบี้ท่ามกลางสมรภูมิการเอาชีวิตรอดสุดแสนสิ้นหวัง</Text>

            </View>
        </ScrollView >
    );
}

function FlameScreen(props) {
    return (
        <ScrollView >
            <View style={{ alignItems: 'center', justifyContent: 'center' }}>
                <View style={{ flexDirection: 'row', marginTop: 20, margin: 15, height: 50, width: 242, borderRadius: 15, paddingHorizontal: 10, backgroundColor: '#AE905E', opacity: 1, borderWidth: 1, borderColor: 'white' }}>
                    <Text style={{ fontSize: 35 }}>รายชื่อตัวละคร </Text>
                </View>

                {/* <Text style={{ padding: 15, fontSize: 28 }}>ของเล่นของแอนดี้</Text> */}
                <View style={{ alignItems: 'center' }}>
                    <Image source={{ uri: "https://i.pinimg.com/564x/4e/4e/33/4e4e33daec5a0043294028d4dd2f7b41.jpg" }}
                        style={{ width: 350, height: 350, borderRadius: 20, marginTop: 15 }} />
                    <Text style={{ fontSize: 25, paddingTop: 10 }}>นัม อน-โจ</Text>

                    <Image source={{ uri: "https://i.pinimg.com/564x/6c/b3/85/6cb385793fcb5cbcf772ff43547a0784.jpg" }}
                        style={{ width: 350, height: 360, borderRadius: 20 }} />
                    <Text style={{ fontSize: 25, paddingTop: 10 }}>อี ชอง-ซาน</Text>


                    <Image source={{ uri: "https://i.pinimg.com/564x/15/be/81/15be811bf051d320f675e2330df1b44b.jpg" }}
                        style={{ width: 350, height: 360, borderRadius: 20, marginTop: 15 }} />
                    <Text style={{ fontSize: 25, paddingTop: 10 }}>ชเว นัม-รา</Text>

                    <Image source={{ uri: "https://i.pinimg.com/564x/4f/48/c8/4f48c8b4797cf81315a50da0688198b1.jpg" }}
                        style={{ width: 350, height: 350, borderRadius: 20, marginTop: 15 }} />
                    <Text style={{ fontSize: 25, paddingTop: 10 }}>อี ซู-ฮยอก</Text>


                    <Image source={{ uri: "https://i.pinimg.com/564x/b7/ec/38/b7ec38a1a494aa4e08bc8325577f156c.jpg" }}
                        style={{ width: 350, height: 360, borderRadius: 20, marginTop: 15 }} />
                    <Text style={{ fontSize: 25, paddingTop: 10 }}>ยุน กวี-นัม</Text>

                    <Image source={{ uri: "https://i.pinimg.com/564x/6d/26/75/6d26753249a09afac64f86223da08ce6.jpg" }}
                        style={{ width: 350, height: 350, borderRadius: 20, marginTop: 15 }} />
                    <Text style={{ fontSize: 25, paddingTop: 10 }}>อี นา-ยอน</Text>

                    <Image source={{ uri: "https://i.pinimg.com/564x/14/39/c6/1439c67c57e93444bee90df74c633f4e.jpg" }}
                        style={{ width: 350, height: 360, borderRadius: 20, marginTop: 15 }} />
                    <Text style={{ fontSize: 25, paddingTop: 10 }}>ยาง แด-ซู</Text>

                    <Image source={{ uri: "https://i.pinimg.com/564x/3f/fe/9d/3ffe9db034c50abfdbf050292a676c82.jpg" }}
                        style={{ width: 350, height: 280, borderRadius: 20, marginTop: 15 }} />
                    <Text style={{ fontSize: 25, paddingTop: 10 }}> โอ จุน-ยอง</Text>

                    <Image source={{ uri: "https://i.pinimg.com/564x/57/70/81/577081951530969b30f25fb515c2d35d.jpg" }}
                        style={{ width: 350, height: 330, borderRadius: 20, marginTop: 15 }} />
                    <Text style={{ fontSize: 25, paddingTop: 10 }}>ซอ ฮโย-รยอง</Text>

                    <Image source={{ uri: "https://i.pinimg.com/564x/8b/68/a5/8b68a5c8f0dbaa7e6b6be38a1425caed.jpg" }}
                        style={{ width: 350, height: 350, borderRadius: 20 }} />

                    <Text style={{ fontSize: 25, paddingTop: 10 }}> จาง อู-จิน</Text>

                    <Image source={{ uri: "https://i.pinimg.com/564x/3f/1a/54/3f1a54b293ab8556819d29670d9b46eb.jpg" }}
                        style={{ width: 350, height: 320, borderRadius: 20, marginTop: 15 }} />

                    <Text style={{ fontSize: 25, paddingTop: 10 }}>ฮัน กยอง-ซู</Text>

                    <Image source={{ uri: "https://i.pinimg.com/564x/61/9f/3e/619f3eb6c9e20aa11715761d87a65b9a.jpg" }}
                        style={{ width: 350, height: 350, borderRadius: 20, marginTop: 15 }} />

                    <Text style={{ fontSize: 25, paddingTop: 10 }}>จาง ฮา-รี</Text>


                    <Image source={{ uri: "https://i.pinimg.com/564x/33/0a/5e/330a5eb444e6de3c9aecd12cb7a40189.jpg" }}
                        style={{ width: 350, height: 330, borderRadius: 20, marginTop: 15 }} />
                    <Text style={{ fontSize: 25, paddingTop: 10 }}>พัก มี-จิน</Text>

                    <Image source={{ uri: "https://i.pinimg.com/564x/99/22/64/992264dfeec2ea4b0fc66c8df501e4f1.jpg" }}
                        style={{ width: 350, height: 350, borderRadius: 20, marginTop: 15 }} />
                    <Text style={{ fontSize: 25, paddingTop: 10 }}>นัม โซ-จู</Text>

                </View>
            </View>
        </ScrollView >
    );
}


function LeafScreen() {
    return (
        <ScrollView>


            <View style={{ alignItems: 'center', justifyContent: 'center' }}>
                <Text style={{ padding: 15, fontSize: 28 }}>10 ประเด็น จาก All of Us Are Dead วัยรุ่น ความรัก ความตาย และปัญหาที่กดทับไว้ในสังคม</Text>
            </View>

            <View>

                <Text style={{ fontSize: 25, padding: 10 }}>1. เมื่อ ‘บ้านหลังที่สอง’ ไม่ปลอดภัย</Text>
                <Text style={{ fontSize: 20, padding: 5, color: '#828282' }}>   การกลั่นแกล้งในโรงเรียนคือประเด็นสำคัญในซีรีส์เกาหลีหลายๆ เรื่อง เช่นเดียวกับ All of Us Are Dead ที่ถูกพูดถึงตั้งแต่ช่วงแรกของซีรีส์ และอย่างที่ทุกคนรู้ดีว่านี่คือ ‘จุดเริ่มต้น’ การแพร่ระบาดเชื้อไวรัส จากความ ‘หวังดี’ ของ อีบยองชาน ครูวิทยาศาสตร์ที่อยากช่วยให้ลูกแข็งแกร่งขึ้น
                มินอึนจี และ คิมชอลซู สองตัวละครสะท้อนความทุกข์ทรมานของการถูกกดขี่ ใช้ความรุนแรง ไปจนถึงคุกคามทางเพศอย่างหนัก แต่สิ่งที่ถูกกระทำจากนักเรียนด้วยกัน ยังไม่น่าเศร้าเท่าการ ‘เพิกเฉย’ ต่อการกลั่นแกล้ง และยังแปะป้ายให้เหยื่อกลายเป็นต้นเหตุคนผิด ผ่านคำพูดของอาจารย์คนหนึ่งที่บอกว่า
                “แล้วมาบอกฉันทำไม เพราะเธอซื่อบื้อถึงได้ถูกรังแกไง”
                บวกกับวิธีการบริหารโรงเรียนของผู้อำนวยการ ที่คิดถึงแต่การ ‘ประเมินผล’ ที่ใกล้เข้ามา แทนที่จะ ‘แก้’ ปัญหา กลับเลือก ‘ซุก’ เอาไว้ใต้พรม เพราะคิดว่าข่าวเรื่องความรุนแรงจะทำให้คะแนนของโรงเรียนต่ำลง สุดท้ายผลของปัญหาที่สะสมกดทับก็ระเบิดมาเป็นความโกรธแค้น เหมือนที่อีบยองชานพูดเอาไว้ว่า
                “ถ้าเมินเฉยกับการใช้ความรุนแรงเล็กน้อย สุดท้ายโลกก็จะถูกความรุนแรงครอบงำ</Text>

                <Image source={{ uri: "https://thestandard.co/wp-content/uploads/2022/02/All-of-Us-Are-Dead-1-1.jpg" }}
                    style={{ width: 450, height: 310, marginTop: 15 }} />

                <Text style={{ fontSize: 25, padding: 10 }}>2. ขั้นตอนเยอะ ล่าช้า ผู้นำต้องรับผิดชอบในทุกการตัดสินใจ</Text>
                <Text style={{ fontSize: 20, padding: 5, color: '#828282' }}>   “เพราะขั้นตอนพวกนั้น ทำให้มีหลายครั้งที่เราช่วยคนไว้ไม่ทัน”
                    คำพูดที่เต็มไปด้วยความเสียใจจากคุณพ่อของนัมอนโจ พนักงานหน่วยดับเพลิงที่ถึงแม้เป็นถึงระดับหัวหน้า แต่ก็ไม่สามารถช่วยเหลือผู้คนได้อย่างอิสระ เพราะต้องคอยรับคำสั่งให้ดูแล ‘ส.ส.’ ที่จัดอยู่ในหมวดบุคคล VIP ที่มีทั้งคนดูแล มีเฮลิคอปเตอร์มารับ ได้รับความสะดวกสบายกว่าชาวบ้านธรรมดาในการกักตัวหรือช่วยเหลือ
                    พอทำภารกิจเสร็จ ก็ยังมีกฎระเบียบและขั้นตอนมากมายรอเขาอยู่ จนสุดท้ายเขาก็ยอมกลายเป็น ‘อาชญากร’ ฝ่าฝืนคำสั่ง ทั้งที่จริงๆ เขาแค่อยากไปช่วยชีวิตลูกสาวที่ติดอยู่ในโรงเรียนเพียงเท่านั้น
                    นอกจากนี้ เรายังได้เห็นวิธีการแก้ปัญหาที่ควรตั้งคำถาม อย่างการ ‘ตัดสัญญาณ’ อินเทอร์เน็ตและโทรศัพท์ เพื่อป้องกันการส่งข้อมูลหรือข่าวปลอมที่อาจทำให้ตื่นตระหนก เท่ากับว่าคนที่ยังรอดชีวิตก็ไม่สามารถติดต่อขอความช่วยเหลือจากใครได้เหมือนกัน
                    รวมทั้งการเลือก ‘ทิ้งระเบิด’ เพื่อจัดการฝูงซอมบี้ในเมืองฮโยซัน ซึ่งแน่นอนว่าต้องมี ‘ผู้รอดชีวิต’ ได้รับลูกหลงไปด้วย เป็นการตัดสินใจที่ยากลำบาก เต็มไปด้วยความสูญเสียและเจ็บปวด และเราไม่กล้ายืนยันว่านี่คือทางเลือกที่ดีที่สุดหรือไม่ แต่เชื่อว่าการตัดสินใจจบชีวิตตัวเองของผู้นำกองทัพ จะเป็นอีกหนึ่งฉากที่หลายคนจะ ‘คิดถึง’ ไปอีกนาน</Text>

                <Text style={{ fontSize: 25, padding: 10 }}>3. ครอบครัว การสูญเสีย และหัวใจแหลกสลายที่ต้องกู้คืนมา </Text>
                <Text style={{ fontSize: 20, padding: 5, color: '#828282' }}>   อีกหนึ่งประเด็นที่เกือบทุกตัวละครต้องพบเจอ และซีรีส์ All of Us Are Dead นำเสนอออกมาได้อย่างน่าสนใจ ตั้งแต่ตัวละครฝั่งผู้ปกครองที่พยายามหาทางช่วยเหลือลูกๆ แม้ต้องแลกด้วยชีวิต
                    แต่อย่างที่รู้ว่าชีวิตนั้นโหดร้ายและไม่อาจเป็นอย่างที่หวัง เด็กๆ หลายคนต้องเห็นภาพพ่อแม่เปลี่ยนสภาพกลายเป็นซอมบี้ อย่างในฉากบินโดรนสำรวจโรงเรียน แล้วเห็นรถบรรทุกพ่อและแม่ของ คิมจีมิน ล้มคว่ำอยู่ และเมื่อบินเข้าไปใกล้ๆ จากความสงสัยกลายเป็นกระจ่างชัดว่าคนที่เรารักไม่มีชีวิตอยู่แล้วจริงๆ พร้อมกับหัวใจและความหวังในการมีชีวิตที่แหลกสลายลงในพริบตา
                    ความสวยงามในความเจ็บปวดของเรื่องนี้คือ ทุกครั้งที่มีคนรู้สึกหมดหวังในชีวิต จะมีเพื่อนๆ คอยอยู่ข้างๆ จับมือ โอบกอด ให้กำลังใจอยู่ไม่ห่าง เป็นแสงเล็กๆ ในวันมืดมน ที่ทำให้ทุกคนกลับไปต่อสู้กับความโหดร้ายอีกมากมายที่รออยู่ไปด้วยกัน</Text>

                <Image source={{ uri: "https://thestandard.co/wp-content/uploads/2022/02/All-of-Us-Are-Dead-3.jpg" }}
                    style={{ width: 450, height: 320, marginTop: 15 }} />

                <Text style={{ fontSize: 25, padding: 10 }}>4. ความสดใส วุ่นวาย และมิตรภาพของ ‘วัยรุ่น’ </Text>
                <Text style={{ fontSize: 20, padding: 5, color: '#828282' }}>   เมื่อการช่วยเหลือไม่มาหา เด็กๆ เลยต้องรวมกลุ่มเอาตัวรอดไปด้วยกัน และกลายเป็นประเด็นสำคัญที่เปิดเผยให้คนดูได้เห็นแง่มุมต่างๆ ในชีวิต ที่แน่นอนว่ามีทั้งมุมที่น่ารัก สดใส อยากตั้งคำถาม ไปจนถึงหงุดหงิดในหลายๆ การกระทำ
                    ถึงแม้จะมีขัดแย้งกันบ้าง แต่อย่างน้อยสิ่งที่ ‘วัยรุ่นฮโยซัน’ แสดงให้เราเห็นอยู่ตลอดเวลาคือ ‘มิตรภาพ’ ที่พร้อมเสียสละเพื่อเพื่อนๆ (หรือคนรัก) อยู่เสมอ ทั้ง ชองซาน ซูฮยอก ที่ไม่เคยทิ้งเพื่อน อนโจที่คอยปลอบใจ หัวหน้าห้อง ‘เสี้ยวบี้’ ที่ช่วยเพื่อนจากวิกฤต แทซูที่ดูบ้าๆ บอๆ แต่ก็พร้อมออกหน้า และ โอจุนยอง หนุ่มเนิร์ดสายนักประดิษฐ์วิทยาศาสตร์ ที่กระโดดเอาตัวไปขวางฝูงซอมบี้ และพูดซ้ำๆ บอกเพื่อนๆ ทุกคนว่า
                    “ไปเถอะ กลับบ้านกันเถอะ”
                    โอจุนยองรู้ดีว่าช่วงวัยรุ่นคือช่วงเวลาที่สำคัญของทุกคน เมื่อเขารู้ว่าตัวเองโดนกัดก็ขอใช้ช่วงเวลาสุดท้ายส่ง ‘เพื่อน’ ที่ถึงแม้บางคนจะรู้จักกันได้ไม่นาน แต่การได้ร่วมสถานการณ์ที่ยากลำบาก ก็ทำให้เขาผูกพันและหวังดีอยากให้ทุกคนได้ ‘กลับบ้าน’ ไปใช้ชีวิตอย่างมีความสุข ไปเป็น ‘วัยรุ่น’ และกอบโกยช่วงเวลาที่ดีที่สุดในชีวิตตอนนี้เอาไว้ </Text>

                <Text style={{ fontSize: 25, padding: 10 }}>5. ความรักสวยงามเสมอ และ ‘พรุ่งนี้’ อาจไม่มีอยู่จริง</Text>
                <Text style={{ fontSize: 20, padding: 5, color: '#828282' }}>   นอกจากมิตรภาพระหว่างเพื่อน ‘ความรัก’ ของ ‘วัยรุ่น’ คืออีกหนึ่งเรื่องราวที่มาช่วยปลอบประโลมจิตใจทั้งของตัวละครและผู้ชมในโลกที่เต็มไปด้วยซอมบี้ได้เป็นอย่างดี
                    ใน All of Us Are Dead นำเสนอความรักหลากหลายรูปแบบ ทั้งอีชองซานที่แอบชอบนัมอนโจ, อนโจชอบซูฮยอก, ซูฮยอกชอบหัวหน้า (และหัวหน้าก็ชอบซูฮยอก) ยังแทซูแอบชอบรุ่นพี่จางฮารี ฯลฯ ซึ่งมีทั้งคู่ที่ผิดหวัง สมหวัง และต้องค่อยๆ พัฒนาความสัมพันธ์กันต่อไป
                    แต่สิ่งหนึ่งที่คล้ายกันคือการบอกว่า ‘วันพรุ่งนี้’ อาจไม่มีอยู่จริง อยากทำอะไรให้รีบทำ อยากสารภาพรักกับใครให้รีบบอก และความรักสวยงามเสมอ เหมือนที่ชองซานได้บอกความในใจ ได้ปกป้องคนที่รัก แล้วตะโกนออกมาว่า
                    “วันนี้ฉันคือคนที่มีความสุขในโรงเรียน” 
                </Text>

                <Image source={{ uri: "https://thestandard.co/wp-content/uploads/2022/02/All-of-Us-Are-Dead-5.jpg" }}
                    style={{ width: 450, height: 150, marginTop: 15 }} />

                <Text style={{ fontSize: 25, padding: 10 }}>6. อีกแง่มุมหนึ่งของความตาย ฝันร้ายที่จะหลอกหลอนไปทั้งชีวิต</Text>
                <Text style={{ fontSize: 20, padding: 5, color: '#828282' }}>   นอกจากการสูญเสียอย่างไม่มีวันกลับ All of Us Are Dead ยังสอดแทรกประเด็นความ ‘รู้สึกผิด’ ที่น่ากลัวยิ่งกว่าความตายเอาไว้อย่างน่าสนใจผ่าน อีนายอน ตัวละครที่หลายคนเกลียดมากที่สุดในเรื่อง

                    อีนายอนคือคนที่เป็นต้นเหตุที่มอบความตายให้กับหลายๆ ตัวละคร ตั้งแต่ ฮันกยองซู ที่ถูกเธอทำให้กลายเป็นซอมบี้ คุณครูที่เสียสละชีวิตให้เธอมีชีวิตอยู่ต่อ พร้อมกับมอบคำสอนสุดท้ายเอาไว้ว่า “ถ้าเธอทำให้ใครตาย การมีชีวิตอยู่ก็จะไม่มีความหมาย”
                    เธอเก็บตัวอยู่ในห้องเสบียงที่เต็มไปด้วยอาหาร แต่ไม่กล้าเอาออกมาให้เพื่อนๆ เพราะรู้สึกผิด แถมยังต้องเผชิญกับภาพหลอนของคนที่จากไป กว่าอีนายอนจะรู้สึกตัว ทุกอย่างก็สายเกินไป เธอตัดสินใจเอาของกินไปให้เพื่อนเพียงลำพัง แต่ผลที่ได้รับคือฝันร้ายที่รออยู่ และที่แย่ไปกว่านั้นคือเธอจากโลกนี้ไปโดยที่เพื่อนๆ จะจำเธอได้แค่ในฐานะ ‘คนเห็นแก่ตัว’ </Text>


                <Text style={{ fontSize: 25, padding: 10 }}>7. “ฉันเพิ่งอายุ 19 ปี แต่ไม่มีความหวังเลย”</Text>
                    <Text style={{ fontSize: 20, padding: 5, color: '#828282' }}>   คำพูดที่ได้ยินแล้วเจ็บไปทั้งหัวใจ จาก จางฮารี รุ่นพี่นักยิงธนูที่สวย เก่ง ฉลาด แต่ในหัวใจเต็มไปด้วยความว่างเปล่า เพราะไม่รู้เลยว่าโลกหลังจากนี้จะมีอะไรที่คนอย่างเธอสามารถทำได้อยู่ 
                    สิ่งที่กัดกินความหวังในซีรีส์ All of Us Are Dead คือฝูงซอมบี้ที่น่ากลัว ตัดภาพมาที่โลกแห่งความเป็นจริง ถึงแม้จะไม่มีซอมบี้ แต่เด็กรุ่นใหม่ก็ยังมีผู้ใหญ่ ความไม่ยุติธรรม ความเหลื่อมล้ำ โลกที่โหดร้าย และอุปสรรคมากมายที่อาจน่ากลัวกว่าฝูงซอมบี้ เพราะหลายอย่างพร้อมที่จะรุมทึ้งความฝันของเด็กๆ หลายคนให้สลายหายไปในพริบตา
                    และถ้าความโหดร้ายนั้นกัดกินความหวังของพวกเขาไปจนหมด อีกไม่นานชีวิตของเด็กๆ เหล่านี้ อาจเหลือเพียงแค่ซากศพที่ยังมีลมหายใจ</Text>

                <Text style={{ fontSize: 25, padding: 10 }}>8. เมื่อ ‘การศึกษา’ น่ากลัวยิ่งกว่าซอมบี้</Text>
                <Text style={{ fontSize: 20, padding: 5, color: '#828282' }}>   นอกจากการกลั่นแกล้งในโรงเรียน การเพิกเฉยต่อปัญหาของอาจารย์และความหวังที่ถูกกัดกิน พัคมีจิน รุ่นพี่ ม.6 ยังฝากคำพูดถึงรุ่นน้องที่กำลังคิดถึงอนาคต และช่วยสะท้อนปัญหาของการศึกษาได้อย่างน่าสนใจ
                    “พวกเธอต้องอยู่รอดให้ถึงปีหน้า แล้วบอกฉันด้วยว่าซอมบี้กับการอยู่ ม.6 อะไรแย่กว่ากัน”
                    ในระบบการศึกษาที่เต็มไปด้วยการแข่งขัน ทุกคนถูกคาดหวังให้สอบเข้ามหาวิทยาลัยที่ดี เพื่อเป็นประตูไปสู่อนาคตที่มั่นคงกว่า โดยที่เด็กๆ หลายคนยังไม่รู้ด้วยซ้ำว่าแท้จริงแล้วพวกเขาอยากเติบโตไปทำอะไรกันแน่ ทำให้ช่วงชีวิตมัธยมที่ควรเต็มไปด้วยความสนุกสนาน ได้ค้นหาสิ่งที่ตัวเองอยากทำ เลยกลายเป็นแค่การนั่งท่องจำข้อสอบเพื่อไปใช้ชีวิตในแบบที่พวกเขาอาจไม่ได้อยากเป็นเท่านั้นเอง</Text>

                <Image source={{ uri: "https://thestandard.co/wp-content/uploads/2022/02/All-of-Us-Are-Dead-8.jpg" }}
                        style={{ width: 450, height: 320, marginTop: 15 }} />

                <Text style={{ fontSize: 25, padding: 10 }}>9. ตัวตนที่ทุกคนใฝ่หา บนโลกมายาที่ไม่มีอยู่จริง</Text>
                <Text style={{ fontSize: 20, padding: 5, color: '#828282' }}>   “กดไลก์ กดแชร์ ให้ผมเยอะๆ นะครับ”
                    ประเด็นนี้ถูกนำเสนอผ่าน 3 ตัวละครหลักๆ คือ ยูทูเบอร์คนหนึ่งที่พยายามเข้ามาถ่ายทอดสดเหตุการณ์ซอมบี้บุกเมืองเพื่อเรียกยอดไลก์ ยอดแชร์ และสุดท้ายความอยากมีตัวตนของเขาทำให้คนอื่นลำบากและเกือบต้องแลกด้วยชีวิต ไม่แน่ถ้าเป็นสถานการณ์แบบในซีรีส์ของประเทศไทย เราอาจเห็นคนทำแบบนี้เหมือนกันก็ได้
                    ยุนควีนัม ที่หลายคนยกให้เป็นแรงบันดาลใจในการ ‘ลุก’ ขึ้นมาต่อสู้ คือตัวแทนของคนที่จริงๆ แล้วอ่อนแอ เป็นลูกกระจ๊อกในแก๊งนักเลง และต้องแสดงออกด้วยการแกล้ง กดขี่ เพื่อพยายามสร้าง ‘ตัวตน’ ที่แข็งแกร่งขึ้นมาปลอบใจตัวเอง
                    ผิดกับ ชเวนัมรา ที่ทุกคนเรียกว่า ‘หัวหน้าห้อง’ ด้วยน้ำเสียงประชดประชัน และแทบไม่มีใครเรียกชื่อจริง ตัวตนของเธอถูกกลืนหาย แต่สุดท้ายเธอก็ยืนยันการมีอยู่ของตัวเองได้ด้วยการให้ความช่วยเหลือ ปกป้อง และมอบความรักความไว้ใจให้กับเพื่อนๆ ทุกคนแทน  </Text>

                <Text style={{ fontSize: 25, padding: 10 }}>10. ประเด็นน่าเสียดายที่น่าขยายความต่อ </Text>
                <Text style={{ fontSize: 20, padding: 5, color: '#828282' }}>   ชัดเจนที่สุดคือประเด็นการตั้งครรภ์ในวัยเรียนที่ถูกปูมาตั้งแต่แรก แต่ไม่ได้ขยายความสำคัญของปัญหา และไม่ได้บอกว่ามีที่มาที่ไปอย่างไร
                    ประเด็นความชอบ ความสนใจเฉพาะทางของเด็กๆ (ยกเว้นรุ่นพี่นักยิงธนู) แต่ละคน เช่น โอจุนยองที่ชอบเรื่องวิทยาศาสตร์และการประดิษฐ์, แทซูที่ร้องเพลงเก่ง, ซูฮยอกที่มีทักษะการต่อสู้สูงมาก รวมทั้งอีกหลายๆ ความชอบของตัวละคร ที่ถ้ามีเวลาให้ขยายความ เราน่าจะได้เห็นภาพความเป็นอยู่ของเด็กๆ มากกว่านี้
                    ประเด็นการทำงานของเจ้าหน้าที่ตำรวจและทหาร ที่น่าจะลงลึกในหลักการให้เห็นปัญหาได้มากกว่านี้ รวมทั้งบทบาทของ ส.ส. กับการเล่นเกมทางการเมืองที่น่าสนใจ สะท้อนอะไรได้หลายอย่าง และคนดูที่อยู่ในสถานการณ์ใกล้เคียงกันน่าจะ ‘กำหมัด’ ได้มากกว่านี้
                    </Text>

                <Image source={{ uri: "https://thestandard.co/wp-content/uploads/2022/02/All-of-Us-Are-Dead-10.jpg" }}
                        style={{ width: 450, height: 350, marginTop: 15 }} />


            </View>
        </ScrollView>

    );
}