import React from 'react';
import { View, Text, Image } from 'react-native';
import { FontAwesome } from '@expo/vector-icons';

// import { createBottomTabNavigator } from '@react-navigation/bottom-tabs';
// const Tab = createBottomTabNavigator();
import { createMaterialTopTabNavigator } from '@react-navigation/material-top-tabs';
import { ScrollView } from 'react-native-gesture-handler';
const Tab = createMaterialTopTabNavigator();

export default function DoraemonTab() {

    return (
        <Tab.Navigator screenOptions={{ tabBarActiveTintColor: "tomato", tabBarInactiveTintColor: "gray", }} >
            <Tab.Screen
                name="FlashScreen"
                component={FlashScreen}
                options={{
                    tabBarLabel: "Short Story",
                    headerShown: false
                }}
            />
            <Tab.Screen
                name="FlameScreen"
                component={FlameScreen}
                options={{
                    tabBarLabel: "Characters",
                    headerShown: false
                }}
            />
            <Tab.Screen
                name="LeafScreen"
                component={LeafScreen}
                options={{
                    tabBarLabel: "Others",
                    headerShown: false
                }}
            />
        </Tab.Navigator>


    );
}
function FlashScreen() {
    return (
        <ScrollView>
            <View style={{ flex: 1, alignItems: 'center' }}>
                <Image
                source={{ uri: "https://i.pinimg.com/564x/1f/d4/73/1fd47353db7017b7759862a47d557dcb.jpg" }}
                style={{ width: 450, height: 333 }}
                />
                <View style={{ flexDirection: 'row', margin: 8 }}>
                <Image
                    source={{ uri: "https://i.pinimg.com/originals/df/4e/c1/df4ec149f28ed8db4896a99013aedf7d.gif" }}
                    style={{ width: 210, height: 200, marginRight: 5 }}
                />
                <Image
                    source={{ uri: "https://i.pinimg.com/originals/aa/87/ff/aa87ff13c38bab30022d9628c60d1fe1.gif" }}
                    style={{ width: 210, height: 200, marginLeft: 5 }}
                />

                </View>

                <Text style={{ fontSize: 30, paddingTop: 20 }}>Doraemon</Text>
                <Text style={{ fontSize: 17, padding: 10, color: '#828282' }}>   เนื้อเรื่องส่วนมากจะเกี่ยวกับปัญหาของ โนบิตะ เด็กชายชั้น ป.4-5 ที่มักถูกเพื่อน ๆ แกล้ง (แต่บ่อยครั้งก็เป็นฝ่ายหาเรื่องใส่ตัวเอง) ไม่ค่อยชอบทำการบ้าน ไม่ชอบอ่านหนังสือและไปโรงเรียนสายบ่อย ๆ โดยมีเพื่อนที่เป็นตัวละครสำคัญในเรื่องคือ โดราเอมอน (โนบิตะทำอะไรไม่ค่อยเป็น ต้องพึ่งโดราเอมอนแทบทุกอย่าง) หุ่นยนต์แมวจากอนาคตที่คอยดูแลช่วยเหลือโนบิตะตลอดเวลาด้วยของวิเศษจากอนาคต ไจแอนท์ เด็กที่ดูเป็นอันธพาลแต่ที่จริงเป็นคนอารมณ์อ่อนไหวและรักการร้องเพลง ซูเนโอะ ผู้มีฐานะทางบ้านดีที่สุดในกลุ่ม มีนิสัยชอบคุยโม้ เป็นคู่หูกับไจแอนท์ที่คอยกลั่นแกล้งโนบิตะอยู่ตลอด เดคิสุงิ เป็นเด็กเรียนเก่ง นิสัยดี รักความถูกต้อง มีน้ำใจ แต่ไม่ค่อยมีบทบาทมากนัก ชิซูกะ ผู้หญิงเพียงคนเดียวในกลุ่มเป็นเด็กเรียนดี ชอบช่วยเหลือผู้อื่น เป็นเด็กสาวที่โนบิตะหลงรัก ในอนาคตก็ได้มาเป็นเจ้าสาวของโนบิตะด้วย ไจโกะ น้องสาวของไจแอนท์ ไม่ค่อยมีบทบาทมากนัก ตัวละครสำคัญนอกจากนี้ก็มี โดเรมี หุ่นยนต์แมวที่มีกระเป๋า 4 มิติและของวิเศษ (แต่จะดูน่ารักในแบบผู้หญิงมากกว่า) เช่นเดียวกับโดราเอมอนผู้เป็นพี่ชาย คุณพ่อและคุณแม่ของโนบิตะ ซึ่งคุณแม่ดูจะมีบทบาทในเรื่องมากกว่าคุณพ่อ</Text>

            </View>
        
        </ScrollView >  
    );
}

function FlameScreen() {
    return (
        <ScrollView>
            <View style={{ alignItems: 'center', justifyContent: 'center' }}>
            <View style={{ flexDirection: 'row', marginTop: 20, margin: 15, height: 50, width: 242, borderRadius: 15, paddingHorizontal: 10, backgroundColor: '#5AD2FF', opacity: 1, borderWidth: 1, borderColor: 'white'}}>
                <Text style={{ fontSize: 35 }}>รายชื่อตัวละคร </Text>
            </View>
            </View>

            <View style={{ alignItems: 'center' }}>
                <Image source={{ uri: "https://i.pinimg.com/564x/5e/a8/20/5ea820f1b71a898338c9d864785b9913.jpg" }}
                    style={{ width: 350, height: 310, borderRadius: 20, marginTop: 15 }} />
                <Text style={{ fontSize: 25, paddingTop: 10 }}>โดราเอมอน (Doraemon)</Text>

                <Image source={{ uri: "https://i.pinimg.com/564x/44/ff/38/44ff3897c370c69f7e09f428b8edf081.jpg" }}
                    style={{ width: 350, height: 300, borderRadius: 20, marginTop: 15 }} />
                <Text style={{ fontSize: 25, paddingTop: 10 }}>โนบิตะ (Nobita)</Text>

                <Image source={{ uri: "https://i.pinimg.com/564x/2b/e1/52/2be1527eb9bed5c1337981c84f3ced7f.jpg" }}
                    style={{ width: 350, height: 300, borderRadius: 20, marginTop: 15 }} />
                <Text style={{ fontSize: 25, paddingTop: 10 }}>ชิซูกะ (Shizuka)</Text>

                <Image source={{ uri: "https://i.pinimg.com/564x/e2/52/bd/e252bdceb89bef4bc5c3a658a0791e22.jpg" }}
                    style={{ width: 350, height: 260, borderRadius: 20, marginTop: 15 }} />
                <Text style={{ fontSize: 25, paddingTop: 10 }}>ซึเนโอะ (Suneo)</Text>

                <Image source={{ uri: "https://i.pinimg.com/564x/55/b8/a1/55b8a1148d6704ee52b8238220d36abe.jpg" }}
                    style={{ width: 350, height: 260, borderRadius: 20, marginTop: 15 }} />
                <Text style={{ fontSize: 25, paddingTop: 10 }}>ไจแอนท์ (Jaian)</Text>

                <Image source={{ uri: "https://i.pinimg.com/564x/32/eb/de/32ebde940b17a2ffa954348f7bc60ca2.jpg" }}
                    style={{ width: 350, height: 300, borderRadius: 20, marginTop: 15 }} />
                <Text style={{ fontSize: 25, paddingTop: 10 }}>โดรามี (Dorami)</Text>

                <Image source={{ uri: "https://i.pinimg.com/564x/7b/5f/fa/7b5ffa10a881b7ebb6519cf561092d1a.jpg" }}
                    style={{ width: 350, height: 280, borderRadius: 20, marginTop: 15 }} />
                <Text style={{ fontSize: 25, paddingTop: 10 }}>ไจโกะ (Jaiko)</Text>

                <Image source={{ uri: "https://i.pinimg.com/564x/fc/77/7b/fc777bbc5b1f226f52421103ba952e28.jpg" }}
                    style={{ width: 350, height: 300, borderRadius: 20, marginTop: 15 }} />
                <Text style={{ fontSize: 25, paddingTop: 10 }}>โนบิ ทามาโกะ(แม่ของโนบิตะ)</Text>

                <Image source={{ uri: "https://upload.wikimedia.org/wikipedia/it/b/b3/Nobisuke_Nobi.png" }}
                    style={{ width: 350, height: 300, borderRadius: 20, marginTop: 15 }} />
                <Text style={{ fontSize: 25, paddingTop: 10 }}>โนบิ โนบิสุเคะ(พ่อของโนบิตะ)</Text>
            </View>
        
        </ScrollView > 
    );
}

function LeafScreen() {
    return (
        <ScrollView>
        <View>
                <Image source={{ uri: "https://www.bookcaze.com/image/cache/catalog/Artiscles_190529_0002-1000x400.jpg" }}
                    style={{ width: 450, height: 280, marginTop: 15 }} />
        </View>
            <View>
                <Text style={{ fontSize: 25, padding: 10 }}>บทเรียนที่ 1 : ตัวเราก็มีของวิเศษในชื่อของควาพยายาม</Text>
                <Text style={{ fontSize: 20, padding: 10, color:'#828282' }}>ในชีวิตจริงเราไม่ได้มีของวิเศษจากกระเป๋าวิเศษของโดราเอมอน เราก็ต้องทำทุกอย่างด้วยตัวเองเพื่อให้บรรลุเป้าหมายที่ต้องการ โดยปราศจากเครื่องมือวิเศษจากโดเรเอมอนนี้แหละ เลยทำให้เราได้สิ่งวิเศษที่เกิดขึ้นกับตัวเราเองนั่นคือ "ความยายาม" ซึ่งสิ่งนี้...จะช่วยเราแก้ไขทุกสิ่ง เราต้องทำงานให้หนัก เพื่อให้เราสามารถบรรลุเป้าหมายที่ต้องการ โดยอาศัยความพยายามของเราเอง หลายครั้งที่ ตัวละครในเรื่องตกอยู่ในสถานการณ์อันตราย โดยปราศจากเครื่องมือของโดราเอมอน แต่สามารถผ่านพ้นอุปสรรคต่างๆนาๆมาได้เพราะด้วย "ความพยายาม" เช่นเดียวกัน</Text>

                <Text style={{ fontSize: 25, padding: 10, marginTop: 10 }}>บทเรียนที่ 2 : ความเป็นมิตรและมีเมตตา </Text>
                <Text style={{ fontSize: 20, padding: 10, color: '#828282' }}>โดราเอมอนนั้นเป็นมิตรและมีความเมตตากับโนบิตะมากแม้โนบิตะจะชอบสร้างปัญหาตลอดเวลา ขี้แย และบางครั้งบางตอนโนบิตะก็ สร้างความเดือนร้อนจนเกือบทำให้โลกแตก แต่โดราเอมอนก็มีความใจเย็นและมีเมตตาไม่เคยทิ้งโนบิตะไปไหนในชีวิตจริงคนเรามักจะคิดถึงพฤติกรรมที่ไม่ดีของผู้อื่นจนทำให้เราไม่สามารถที่จะมีเมตตากับคนอื่น นำมาซึ่งความสัมพันธ์ที่แย่กับคนรอบข้าง หากคุณทำตามนิสัยของโดราเอมอนคุณจะได้รับความเป็นมิตรความเมตตาจากผู้อื่นและมีความสัมพันธ์ที่ดีขึ้นได้อีกด้วย</Text>

                <Text style={{ fontSize: 25, padding: 10, marginTop: 10 }}>บทเรียนที่ 3 : หากคุณเอาแว่นขยายควาสำเร็จที่ยิ่งใหญ่คุณจะเจอความล้มเหลวในนั้นเป็นจำนวนมาก...โดราเอมอนก็เช่นกัน</Text>
                <Text style={{ fontSize: 20, padding: 10, color: '#828282' }}>โดราเอม่อนนั้นไม่ใช่สิ่งมีชีวิต แต่ว่ามันเป็นหุ่นยนต์แมวสีฟ้าที่เกิดมาจากข้อผิดพลาดในขบวนการผลิตในขณะที่กำลังสร้างโดเรม่อนอยู่นั้น บังเอิญว่าชิฟตัวหนึ่งเกิดหล่นหายไปนั่นจึงเป็นสาเหตุให้โดเรม่อนมักจะหยิบของออกมาจากกระเป๋าผิดบ่อยๆ แล้วก็ทำให้มันไม่เหมือนหุ่นยนต์แมวตัวอื่นๆ ด้วยเหตุนี้โดราเอม่อนจึงต้องเข้ารับการอบรมพิเศษที่โรงเรียนหุ่นยนต์ เมื่อแรกเกิดนั้นโดเรม่อนเป็นแมวที่มีใบหูและมีตัวสีเหลืองเหมือนกับหุ่นยนต์แมวตัวอื่นๆ แต่แล้วในวันที่ 30 สิงหาคม ค.ศ. 2122 หนูได้แอบมาแทะหูของโดราเอม่อนในขณะที่มันนอนหลับจนแหว่งไปทั้งสองข้าง
                โดราเอม่อนถูกนำตัวส่งโรงพยาบาลหุ่นยนต์และน่าเศร้ามากเพราะหูของมันไม่สามารถซ่อมแซมได้ โนราเมียโกะแฟนสาวของโดราเอม่อนซึ่งเป็นหุ่นยนต์แมวเหมือนกันได้เดินทางมาเยี่ยม พอเธอเห็นว่าโดราเอม่อนนั้นเหลือแต่หัวกลมๆ ไม่มีหูก็หัวเราะออกมาด้วยความขบขัน ซึ่งทำให้โดราเอม่อนเสียใจมาก มันพยายามทำใจโดยหยิบยาเสริมกำลังใจจากกระเป๋าวิเศษออกมาดื่ม แต่ว่ามันดันหยิบยาผิด โดยหยิบเอายาโศรกเศร้ามาดื่มแทน เลยทำให้โดราเอม่อนเศร้าหนักกว่าเดิมจนแอบไปร้องไห้ที่ริมทะเลสามวันสามคืนจนสีถลอก ตั้งแต่นั้นเป็นต้นมาโดราเอม่อนก็กลายเป็นแมวที่กลัวหนูสุดชีวิตและมันยังขาดความมั่นใจในเรื่องความรักอีกด้วย</Text>

                <Image source={{ uri: "https://i.pinimg.com/564x/03/11/34/03113438f777a823c31051e7a7002a90.jpg" }}
                    style={{ width: 450, height: 280, marginTop: 15 }} />

                <Text style={{ fontSize: 25, padding: 10, marginTop: 10 }}>บทเรียนที่ 4 : คนที่ไม่มี"ดี"..."ไม่มีในโลก"</Text>
                <Text style={{ fontSize: 20, padding: 10, color: '#828282' }}>แต่ต้องเรียนรู้และดูดซับสิ่งที่มีประโยชน์ ปฏิเสธส่วนที่บกพร่องของเราแทน ข้อบกพร่องของตัวละครโนบิตะคือ ขี้เกียจ ไม่มีการเตรียมพร้อม ไม่มีไหวพริบ อ่อนแอ อับโชคและฝีมือการเล่นกีฬาก็ไม่เอาไหน

                แม้โนบิตะจะมีข้อบกพร่องมากมาย แต่โนบิตะก็มีความสามารถพิเศษที่ยอดเยี่ยมของเขาในการสานรูปสตริงที่ซับซ้อน ต่อมาโนบิตะเห็นข้อดีของตัวเองมุ่งมั่นจนกลายเป็นผู้เชี่ยวชาญด้านหุ่นยนต์เพื่อแก้ไขโดราเอมอนได้สำเร็จ

                เนื่องด้วยตอนจบอีกแบบหนึ่งของโดราเอมอนคือ อยู่ดีๆ วันหนึ่งโดราเอมอนก็เกิด แบตเตอรี่ หมด แล้วหยุดทำงานเสียเฉยๆ โนบิตะจึงปรึกษากับโดเรมี น้องสาวของโดราเอมอน โดเรมีบอกโนบิตะว่า ถ้าเปลี่ยนแบตเตอรี่ของโดราเอมอน ความจำทั้งหลายจะหายหมด เนื่องจากแบตเตอรี่สำรองไฟที่เก็บความจำของหุ่นยนต์รูปแมวนั้นเก็บไว้ที่หู และอย่างที่ทราบกันว่าโดราเอมอนไม่มีหู ดังนั้นถ้าเปลี่ยนแบตเตอรี่ เขาจะต้องสูญเสียความจำ ต้องนำไปซ่อมที่โลกอนาคต แต่การใช้ ไทม์แมชชีน นั้นผิดกฎหมาย เพราะกฎหมายใหม่ของโลกอนาคต ถ้าส่งโดราเอมอนกลับ โดราเอมอนจะมาหาโนบิตะอีกไม่ได้ ทำให้โนบิตะตัดสินใจไม่เปลี่ยนแบตเตอรี่ แล้วโนบิตะจึงตัดสินใจตั้งใจเรียนจนเป็น นักวิทยาศาสตร์ ระดับโลก โดยเอาเรื่องโดราเอมอนที่แบตหมดมาเป็นแรงผลักดันขยันทุ่มเทหาทางรักษาให้โดราเอมอนกลับมา โดยเอาตัวโดราเอมอนไปซ่อนไม่ให้มีใครรู้เรื่องนอกจากตนเพียงคนเดียวเท่านั้น แล้วก็แต่งงานกับชิซุกะและสามารถซ่อมโดราเอมอนกับสร้างหูกับทำให้ร่างของโดราเอมอนเป็นตัวสีเหลืองก่อนถูกซื้อ กับเปลี่ยนแบตเตอรี่ให้โดราเอมอนได้สำเร็จ โดยที่ความทรงจำไม่หายไป (โดยก่อนที่โนบิตะจะเปลี่ยนแบตเตอรี่ให้โดราเอมอนได้เรียกชิซุกะมาดูโดราเอมอน) และเขาก็มีลูกชายชื่อโนบิสุเกะ และอยู่ด้วยกันอย่างมีสุข</Text>

                <Text style={{ fontSize: 25, padding: 10, marginTop: 10 }}>บทเรียนที่ 5 : เรียนรู้ที่จะต้องมีชีวิตที่แข็งแกร่ง</Text>
                <Text style={{ fontSize: 20, padding: 10, color: '#828282' }}>โนบิตะมักจะแสดงให้เห็นว่าเป็นคนขี้ขลาด อ่อนเเอ แต่เขาก็มักจะเสี่ยงชีวิตเพื่อช่วยผู้อื่นหรือแม้แต่อารยธรรมบนโลกได้เสมอ เพราะเขาเรียนรู้ที่จะต้องมีชีวิตที่แข็งแกร่งได้จากการถูกแกล้งอยู่บ่อยๆ อะไรที่ฆ่าเราไม่ตาย สิ่งนั้นจะสร้างให้เราเติบโต</Text>

                <Text style={{ fontSize: 25, padding: 10, marginTop: 10 }}>บทเรียนที่ 6 : มีความรับผิดชอบต่อสิ่งที่เราทำ</Text>
                <Text style={{ fontSize: 20, padding: 10, color: '#828282' }}>โนบิตะมักจะชอบขโมยอุปกรณ์วิเศษของโดราเอมอนจนทำให้หลายครั้ง เค้าใช้อุปกรณ์เหล่านั้นผิดพลาด และสร้างความเดือดร้อน แต่โนบิตะก็รับผิดชอบต่อการกระทำของเค้าเสมอ</Text>

                <Image source={{ uri: "https://i.pinimg.com/564x/44/11/70/441170149a4ddd5673cf7aedbb09eca2.jpg" }}
                    style={{ width: 450, height: 280, marginTop: 15 }} />

                <Text style={{ fontSize: 25, padding: 10, marginTop: 10 }}>บทเรียนที่ 7 : เปลี่ยนแปลงอนาคตได้เสมอโดยใช้ "วันนี้"</Text>
                <Text style={{ fontSize: 20, padding: 10, color: '#828282' }}>เราไม่สามารถย้อนกลับไปเปลี่ยนอดีตได้ดังนั้นเราจึงเปลี่ยนอนาคตด้วยการทำวันนี้ให้ดีที่สุดโนบิตะกลายเป็นผู้เชี่ยวชาญด้านหุ่นยนต์เพื่อแก้ไขโดราเอมอน เหตุการณ์นี้กลายเป็นเหตุการณ์ที่สำคัญที่สุดในประวัติศาสตร์ของมนุษย์เพราะเค้าเริ่มใช้ "วันนี้ "ในทุกๆวันจนกระทั่งทำสิ่งที่ต้องการได้สำเร็จ</Text>

                <Text style={{ fontSize: 25, padding: 10, marginTop: 10 }}>บทเรียนที่ 8 : หากเราเอาชนะคนอื่น เราจะแพ้ตัวเองทุกที</Text>
                <Text style={{ fontSize: 20, padding: 10, color: '#828282' }}>อย่าพยายามทำตัวให้ดีกว่าคนอื่น พยายามทำตัวให้ดีกว่าตัวคุณเอง หลังจากสะท้อนเหตุการณ์หนึ่งเกี่ยวกับวันเกิดของเขาไจแอนท์ เขานึกถึงตัวเองว่าทำไมเขาถึงไม่ได้รับความนิยมในหมู่เพื่อนฝูง โดราเอมอนเลยช่วยบอกเกี่ยวกับนิสัยที่ไม่ดีที่ดื้อด้านและพยายามจะข่มคนอื่นอยู่เสมอของไจแอนท์ เมื่อไจแอนท์รับรู้และเข้าใจก็เลยขอโอกาสจากโดราเอมอนอีกครั้งนึง</Text>

                <Text style={{ fontSize: 25, padding: 10, marginTop: 10 }}>บทเรียนที่ 9 : ใช้ชีวิตให้ยืดหยุ่นผ่อนปรนได้บ้าง </Text>
                <Text style={{ fontSize: 20, padding: 10, color: '#828282' }}>ซูเนโอะคือตัวละครที่แสดงบทบาทความต้องการที่จะเป็นคนที่สมบูรณ์พร้อมในทุกสิ่งจนเกินไป ทำให้ลึกๆแล้วเค้าก็ไม่มีความสุขเอาเสียเลย เพราะฉะนั้นโปรดอย่าจริงจังเกินไป มีความสุขกับสิ่งที่คุณมีและเปล่งประกายพรสวรรค์ของคุณออกมาอย่างดีที่สุด!</Text>

                <Image source={{ uri: "https://i.pinimg.com/564x/77/dc/cd/77dccd1059d93ba85e4676c85a72f81d.jpg" }}
                    style={{ width: 450, height: 280, marginTop: 15 }} />

                <Text style={{ fontSize: 25, padding: 10, marginTop: 10 }}>บทเรียนที่ 10 : หาเป้าหมายที่สร้างความภูมิใจในชีวิตให้เจอ</Text>
                <Text style={{ fontSize: 20, padding: 10, color: '#828282' }}>ความสำเร็จคือการเดินทางไม่ใช่จุดหมายปลายทาง โดราเอมอนประสบความสำเร็จในภารกิจของเขาที่เห็นในหลายตอนที่พวกเขาเดินทางไปสู่อนาคตต เพื่อช่วยโนบิตะในคืนก่อนวันแต่งงาน ในที่สุดโนบิตะแต่งงานกับชิซูกะและมีลูกชายคนหนึ่งซึ่งมีบทบาทในการพลิกผันกลายมาเป็นเด็กที่เข้มแข็งที่ไม่มีใครรังแกได้ต่อไป</Text>

                    
            </View>
        
        
        </ScrollView>

    );
}
