import React from 'react';
import { View, Text, Image, ScrollView, FlatList } from 'react-native';
import { FontAwesome } from '@expo/vector-icons';
import { createMaterialTopTabNavigator } from '@react-navigation/material-top-tabs';

const Tab = createMaterialTopTabNavigator();

export default function ParasiteTab() {

    return (
        <Tab.Navigator screenOptions={{ tabBarActiveTintColor: "tomato", tabBarInactiveTintColor: "gray", }} >
            <Tab.Screen
                name="FlashScreen"
                component={FlashScreen}
                options={{
                    tabBarLabel: "Short Story",
                    headerShown: false
                }}
            />
            <Tab.Screen
                name="FlameScreen"
                component={FlameScreen}
                options={{
                    tabBarLabel: "Characters",
                    headerShown: false
                }}
            />
            <Tab.Screen
                name="LeafScreen"
                component={LeafScreen}
                options={{
                    tabBarLabel: "Others",
                    headerShown: false
                }}
            />

        </Tab.Navigator>


    );

}
function FlashScreen() {
    return (
        <ScrollView contentContainerStyle={{ flexGrow: 1, alignItems: 'center' }}>
            <View style={{ flex: 1, alignItems: 'center' }}>
                <Image
                    source={{ uri: "https://i.pinimg.com/564x/c5/f4/d2/c5f4d22b3ec2e459b74514686545f419.jpg" }}
                    style={{ width: 450, height: 280 }}
                />
                <View style={{ flexDirection: 'row', margin: 8 }}>
                    <Image
                        source={{ uri: "https://64.media.tumblr.com/2b018d44365677684b93a4c8d03c84c6/7eb20102874aaf6a-8d/s540x810/4c1d130beabf542c1832d738fa85d16aa5749b1c.gifv" }}
                        style={{ width: 220, height: 160, marginRight: 5 }}
                    />
                    <Image
                        source={{ uri: "https://64.media.tumblr.com/e89af30fff69635cbe84ea5d3a1ccedb/7eb20102874aaf6a-5e/s540x810/bfa912ddbdb9fd6fb29439de08ef7539b1bb7092.gifv" }}
                        style={{ width: 210, height: 160, marginLeft: 5 }}
                    />

                </View>

                <Text style={{ fontSize: 30, paddingTop: 20 }}>Parasite</Text>
                <Text style={{ fontSize: 17, padding: 10, color: '#828282' }}>   หลังจากความล้มเหลวของการวิจัยทางวิทยาศาสตร์ โรงเรียนมัธยมปลายท้องถิ่นเต็มไปด้วยซอมบี การต่อสู้สุดตึงเครียดระหว่างนักเรียนที่กลายเป็นฝูงซอมบี้กับบรรดาผู้รอดชีวิตที่ดิ้นรนหนีตาย โดยกลุ่มนักเรียนที่รอดชีวิตต่างพยายามหาทางเอาตัวรอดจากเหตุการณ์นี้ โดยไม่มีโทรศัพท์ ไม่มีอาหาร และไม่มีใครเหลียวแล พวกเขาต้องใช้สิ่งของและอุปกรณ์รอบตัวในโรงเรียน ไม่ว่าจะเป็น โคมไฟ ชั้นหนังสือ แม้กระทั่ง คันธนู เพื่อปกป้องตนเองจากฝูงซอมบี้ท่ามกลางสมรภูมิการเอาชีวิตรอดสุดแสนสิ้นหวัง</Text>

            </View>
        </ScrollView >
    );
}

function FlameScreen(props) {
    return (
        <ScrollView >
            <View style={{ alignItems: 'center', justifyContent: 'center' }}>
                <View style={{ flexDirection: 'row', marginTop: 20, margin: 15, height: 50, width: 242, borderRadius: 15, paddingHorizontal: 10, backgroundColor: '#AE905E', opacity: 1, borderWidth: 1, borderColor: 'white' }}>
                    <Text style={{ fontSize: 35 }}>รายชื่อตัวละคร </Text>
                </View>

                <View style={{ alignItems: 'center' }}>
                    <Text style={{ fontSize: 25, paddingTop: 10 }}>ครอบครัวของคิม กีแท็ก</Text>
                    <Image source={{ uri: "https://www.matichonweekly.com/wp-content/uploads/2019/08/pvcf8b18s1OqFNIXR5K7-o.jpg" }}
                        style={{ width: 400, height: 350, borderRadius: 20, marginTop: 15 }} />
                    <Text style={{ fontSize: 25, paddingTop: 10 }}>คิม กีอู / คิม กีแท็ก / ชุงซุก / คิม กีจอง</Text>

                    <Text style={{ fontSize: 25, paddingTop: 20 }}>ครอบครัวของหัวหน้าพัค</Text>
                    <Image source={{ uri: "https://raw.githubusercontent.com/JN-JANE/image/main/1.jpg" }}
                        style={{ width: 400, height: 350, borderRadius: 20, marginTop:15}} />
                    <Text style={{ fontSize: 25, paddingTop: 10 }}>พัค ดงอิก(หัวหน้าครอบครัว) / ยอน-กโย(ภรรยา) / พัค ดาฮเย (ลูกสาว) / พัก ดาซง(ลูกชาย)</Text>

                    <Text style={{ fontSize: 25, paddingTop: 20 }}>ตัวละครอื่นๆ</Text>
                    <Image source={{ uri: "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR2V3vST1rxSd2TtPVhXNfLyEHtwZvpGxqTLtae-fzP0Q&s" }} 
                        style={{ width: 350, height: 360, borderRadius: 20, marginTop: 15 }} />
                    <Text style={{ fontSize: 25, paddingTop: 10 }}>กุก มุนกวัง(แม่บ้านคนเก่า) </Text>

                    <Image source={{ uri: "https://static.wikia.nocookie.net/villains/images/a/a5/Geun_sae.png/revision/latest/scale-to-width-down/340?cb=20200406042401" }}
                        style={{ width: 350, height: 400, borderRadius: 20, marginTop: 15 }} />
                    <Text style={{ fontSize: 25, paddingTop: 10 }}>กึนเซ(สามีของมุนกวัง)</Text>


                    <Image source={{ uri: "https://image.tmdb.org/t/p/w500/j3AEOJskfSm7nhR8RnDm6njRN3W.jpgg" }}
                        style={{ width: 350, height: 400, borderRadius: 20, marginTop: 15 }} />
                    <Text style={{ fontSize: 25, paddingTop: 10 }}> คนขับรถยุน(อดีตคนขับรถของครอบครัวพัค)</Text>

                    <Image source={{ uri: "https://popseries.co/wp-content/uploads/2023/04/Park-Seo-Joon-jpg.webp" }}
                        style={{ width: 350, height: 350, borderRadius: 20, marginTop: 15 }} />
                    <Text style={{ fontSize: 25, paddingTop: 10 }}> มินฮยอก(เพื่อนของกีอู (ปรากฏตัวพิเศษ))</Text>

                </View>
            </View>
        </ScrollView >
    );
}


function LeafScreen() {
    return (
        <ScrollView>


            <View style={{ alignItems: 'center', justifyContent: 'center' }}>
                <Text style={{ padding: 15, fontSize: 28 }}>Parasite ในโลกแห่งความเหลื่อมล้ำ ใครกันน่าโกรธที่สุด</Text>
            </View>

            <View>

                <Text style={{ fontSize: 20, padding: 5, color: '#828282' }}>   Parasite คือผลงานเรื่องล่าสุดของบองจุนโฮ (Bong Joon-ho) ผู้กำกับชื่อดังชาวเกาหลีใต้ และกลายเป็นภาพยนตร์เกาหลีเรื่องแรกที่คว้ารางวัลปาล์มทองคำในเทศกาลหนังเมืองคานส์ ทั้งยังทำรายได้สูงสุดในหลายประเทศแซง Train to Busan ไปเป็นที่เรียบร้อย นี่คือหนังแมสที่มาพร้อมประเด็นหนักๆ ซึ่งตรึงผู้ชมไว้ได้อย่างอยู่หมัด

                    บองจุนโฮเป็นผู้กำกับที่ปักหมุดเล่าเรื่องความเหลื่อมล้ำอย่างชัดเจนตลอดมา หนังหลายเรื่องของเขาว่าด้วยการปะทุเดือดของคนจนที่ถูกกดทับ และหลายครั้งหนังก็ไม่ได้วิพากษ์ทุนนิยมในแบบที่เรามักจะเห็นคู่ตรงข้ามเป็น คนรวยที่ชั่ว-คนจนที่ดี แต่หนังของเขายังพาไปถึงความเป็นมนุษย์ที่บิดเบี้ยวท่ามกลางโชคชะตาที่เอาแต่เล่นตลกในโลกทุนนิยม และการต่อสู้นั้นบางครั้งก็ไร้ความหมาย อย่าง Mother (2009) ที่เล่าเรื่องแม่ผู้พยายามต่อสู้เพื่อลูกชายปัญญาอ่อนที่ถูกกล่าวหาว่าเป็นฆาตกร เธอต้องต่อสู้กับกระบวนการยุติธรรมที่มักจะเอื้อประโยชน์กับคนรวยแต่คนซวยคือคนจน การต่อสู้ของเธอห้าวหาญ ท้าทาย แต่ท้ายที่สุดแล้วเรื่องกลับเป็นหนังอีกม้วน ตอนจบของเรื่องจึงเลวร้ายกว่าที่ใครจะคาดคิด ซึ่งหากถามว่าเรื่องนี้ใครเป็นคนผิด คงไม่มีใครตอบได้เต็มปาก

                    และ Parasite ก็เช่นกัน หนังสะท้อนให้เห็นถึงความเลวร้ายของระบบทุนนิยมว่ามันทำให้มนุษย์ในสังคมบิดเบี้ยวไปได้มากแค่ไหน และในที่สุดทุกคนก็ได้รับผลกระทบจากความบิดเบี้ยวเหล่านั้นไม่ว่าจะรวยหรือจนก็ตาม เหมือนร่างกายที่มีปรสิต นานวันเข้าปรสิตสะสมมากขึ้น ร่างนั้นก็ต้องเจ็บป่วย และบางทีปรสิตนั้นอาจไม่ใช่เหล่าคนจนที่มีคนรวยเป็นโฮสต์ แต่ร่างโฮสต์นั้นคือประเทศหนึ่งๆ ที่มีผลผลิตอย่างหนึ่งของระบบทุนนิยมกำลังชอนไชอยู่</Text>

                <Image source={{ uri: "https://themomentum.co/wp-content/uploads/2019/07/TheMO-Parasite_content06.jpg" }}
                    style={{ width: 450, height: 310, marginTop: 15 }} />

                <Text style={{ fontSize: 20, padding: 5, color: '#828282' }}>   Parasite ว่าด้วยเรื่องของครอบครัวคนจนที่พ่อแม่เก่งงาน กับลูกชายลูกสาวที่มีพรสวรรค์ แต่สิ่งที่ขาดคือโอกาสและเงิน กับครอบครัวปาร์ก ครอบครัวคนรวยโลกสวยที่ไม่สนใจอะไรนอกจากความรุ่มรวยในแวดวงของตัวเอง บองจุนโฮดำเนินเรื่องไปด้วยการเสียดสีเต็มรูปแบบ และในครั้งนี้เขาก็ใช้ ‘โลเคชั่น’ หรือศักยภาพในการเข้าถึงพื้นที่หนึ่งๆ เป็นข้อสะท้อนเด่นชัดเรื่องความเหลื่อมล้ำ แบบเดียวกับที่เล่าถึงพวกคนหัวขบวนกับคนท้ายขบวนใน Snowpiercer (2013) อีกหนึ่งหนังดังของเขา ใน Parasite เขาเสนอภาพถนนต่อถนน บ้านต่อบ้าน ขณะที่ฝนตกในบ้านหลังหนึ่งกลายเป็นบรรยากาศชวนดื่มด่ำ แต่ฝนตกในบ้านอีกหลังคือน้ำท่วมเกือบมิดเพดาน เป็นน้ำสกปรกจากท่อที่มีน้ำจากส้วมพวยพุ่งออกมาผสมโรงด้วย

                    ความอัตคัดขั้นสุดทำให้คนจนต้องเคลื่อนไหว และการพยายามปฏิวัติของคนจนในเรื่องนี้ก็ไม่ได้ถูกนำเสนอแบบฮีโร่อย่างที่เคยทำใน Snowpiercer คนจนในเรื่องนี้มาในแบบของพวกขี้โกง แม้ไม่ได้หวังจะมาแทนที่เสียทีเดียวแต่ก็หวังจะเกาะกินสูบเลือดสูบเนื้อไปเรื่อยๆ พวกเขายังมีหวังถึงขั้นการเลื่อนชนชั้นผ่านการแต่งงาน เพราะคิดว่าตัวเองอาจไปอยู่ตรงนั้นได้ (แต่ที่สุดแล้วก็พบว่ากำแพงนั้นสูงเหลือเกิน)</Text>
                <Image source={{ uri: "https://themomentum.co/wp-content/uploads/2019/07/TheMO-Parasite_content02.jpg" }}
                    style={{ width: 450, height: 310, marginTop: 15 }} />

                <Text style={{ fontSize: 20, padding: 5, color: '#828282' }}>   อันที่จริงความหวังจะเลื่อนชนชั้นของพวกเขามีอยู่ตั้งแต่ก่อนเจอครอบครัวปาร์ก เราจะเห็นว่าคีวู ลูกชายคนโตของบ้าน เรียนเก่งระดับที่เป็นครูสอนพิเศษภาษาอังกฤษบ้านคนรวยได้ และจากที่เพื่อนของเขาบอกในตอนต้นเรื่อง เขาเก่งกว่าพวกเด็กมหา’ลัยหลายคนด้วยซ้ำ แต่คีวูกลับเลือกที่จะรอ สอบที่เดิมไปเรื่อยๆ จนกว่าจะติดมหาวิทยาลัยที่ดีที่สุด เพราะนั่นหมายถึงการเลื่อนชั้นแบบก้าวกระโดดรองจากการไปเรียนต่างประเทศ ขณะที่เพื่อนของคีวูเอง เมื่อมีโอกาสไปเรียนต่อต่างประเทศ เขาก็รีบคว้าโอกาสนั้นแทนที่จะอยู่รับเงินจากครอบครัวปาร์กต่อ ซึ่งการรอคอยเป็นปีๆ อย่างที่คีวูทำ ไม่ใช่เรื่องแปลกในเกาหลีใต้ จากคำบอกเล่าของเพื่อนชาวเกาหลีของผู้เขียน พบว่ามีนักเรียนหัวดีหลายคนเลือกทำอย่างนั้น พวกเขายอมมีแก็ปเยียร์อันหนักหน่วงเพื่อจะสอบเข้ามหาวิทยาลัยชั้นนำแทนที่จะยอมเรียนมหาวิทยาลัยระดับรองลงมา เพราะฐานะหน้าตาทางสังคมหลังเรียนจบนั้นจะต่างกันลิบลับ

                    และเมื่อทางตรงมันยังไม่ได้ คีวูจึงเลือกใช้ทางลัด นั่นคือการเมคโพรไฟล์เข้าไปสอนพิเศษให้กับลูกสาวตระกูลปาร์ก รวมถึงเมคโพรไฟล์ของทุกคนในบ้าน เพื่อเข้าไปทำงานในบ้านหลังนั้นแบบยกครัว โดยหารู้ไม่ว่ามีใครบางคนจับจองฐานะปรสิตของตระกูลปาร์กอยู่ก่อนตั้งนานแล้ว

                    เมื่อคนที่หวังแบ่งกินผลประโยชน์จากคนรวยไม่ได้มีคนเดียว เรื่องจึงน่าสนใจขึ้นอีกที่มันได้กลายเป็นการห้ำหั่นกันเองของคนจน แม้จะมีเสี้ยวหนึ่งที่พวกเขาเป็นห่วงเป็นใยคนอื่น ว่าคนขับรถที่ถูกใส่ร้ายให้ถูกไล่ออกนั้นจะไปมีชีวิตอย่างไร หรือคนที่ถูกขังไว้ใต้ดินจะหิวหรือเปล่า แต่เมื่อสถานการณ์คับขันพวกเขาก็เลือกที่จะใช้ก้อนหินใหญ่หรือมีดเพื่อเผชิญหน้ากัน

                    ครอบครัวคนรวยจึงไม่ได้เป็นศัตรูของคนจนโดยตรง แต่คล้ายเป็นตัวเปรียบเทียบให้คนจนได้เห็นว่าชีวิตของพวกเขาห่างไกลกันมากแค่ไหน และโลกนี้ไม่ยุติธรรมขนาดไหน ทั้งสองครอบครัวต่างถูกออกแบบให้เป็นคู่ตรงข้ามของกันและกัน ชัดเจนที่สุดคงเป็น ‘แม่บ้าน’ ที่ฝ่ายหนึ่งก็จัดจ้านทำงานเก่งพิษสงรอบตัว ส่วนอีกฝ่ายก็ใสๆ ไม่เป็นพิษเป็นภัยกับใคร ซึ่งคำอธิบายของฝ่ายแม่บ้านคนจนก็กลายเป็นประโยคที่ติดใจใครหลายคน —“คนรวยนิสัยดี เพราะไม่มีอะไรให้กังวลไง” ใช่ เมื่อพวกเขาไม่ได้ขาดอะไร ก็ไม่จำเป็นต้องไปแย่งชิงอะไรกับใคร  และขณะที่คนรวยเป็นกังวลกับความติสต์เกินเหตุของลูก หรือไม่ก็ลูกจ้างที่ไม่เพอร์เฟ็กต์ แต่คนจนต้องเป็นกังวลกับทุกสิ่ง และพวกเขาก็ต้องดิ้นรน</Text>
                    <Image source={{ uri: "https://themomentum.co/wp-content/uploads/2019/07/TheMO-Parasite_content05.jpg" }}
                    style={{ width: 450, height: 320, marginTop: 15 }} />

                <Image source={{ uri: "https://themomentum.co/wp-content/uploads/2019/07/TheMO-Parasite_content03.jpg" }}
                    style={{ width: 450, height: 320, marginTop: 15 }} />

                <Text style={{ fontSize: 20, padding: 5, color: '#828282' }}>   และฉากที่ตอนแรกคล้ายจะทำให้คนดูหวาดเสียวว่าพวกคนจนที่แอบเข้ามากินเหล้าฉลองในบ้านคนรวยจะถูกจับได้หรือไม่ ก็กลายเป็นฉากสุดกระอักกระอ่วน การที่ครอบครัวคนจนถูกสถานการณ์บังคับให้ต้องมานอนเบียดกันอยู่ใต้โต๊ะรับแขก โดยบนโซฟานั้นมีสองผัวเมียคนรวยนอนเล้าโลมกันอยู่ ความเจ็บปวดกว่าการโป๊ะแตกก็คือพวกเขาต้องมารับฟังคำเหยียดหยามแบบจริงใจสุดๆ กลิ่นคนจนอย่างไรก็ปิดไม่มิด มันเป็นกลิ่นของพวกคนทำงานรับจ้าง กลิ่นของพวกที่ใช้รถไฟใต้ดิน และกางเกงในราคาถูก ก็กลายเป็นเพียงความดิบเถื่อนที่ใช้กระตุ้นอารมณ์ทางเพศ

                    ครอบครัวปาร์กอาจจะยอมให้คนจนมาอยู่ใกล้ๆ เพื่อจะรับความสะดวกสบายจากการรับใช้ พวกเขาดูจะเปิดรับและเป็นมิตร แต่ก็ไม่แม้แต่จะปรายตามองไปยังแง่มุมอื่นๆ ในชีวิตคนจนเหล่านั้น พวกเขาเห็นแค่เท่าที่สบายใจจะเห็น หากไม่สบายใจจะเห็นก็พร้อมที่จะเขี่ยทิ้งทันที

                    สำหรับผู้เขียนแล้ว การออกแบบตัวละครคนรวยในเรื่องนี้ถือว่าทำได้น่าสนุก หนังไม่ได้กล่าวโทษคนรวยว่าชั่วร้าย แต่ก็ไม่ได้ทำให้พวกเขาดูดีขนาดนั้น คนรวยดูสวยหล่อสบายตา ไลฟ์สไตล์เลิศหรู ไม่ต้องวางแผนอะไรมากชีวิตก็ดีพร้อม ขณะเดียวกันฝ่ายเมียก็ไร้เดียงสาเกินเหตุ ฝ่ายผัวก็ปิดบังความหยิ่งยโสไม่มิดเอาเสียเลย หรือคุณสถาปนิกผู้ทรงเกียรติ ที่ออกแบบบ้านหลังนี้เอาไว้ ก็ยังแอบสร้างห้องใต้ดินสำหรับหลบภัยสงครามหรือเอาไว้หลบเมื่อเจ้าหนี้มาตาม เราเห็นความแตกต่างลิบลับระหว่างดีไซน์ของบ้านบนดินกับห้องใต้ดิน แม้จะเป็นบ้านหลังเดียวกัน ว่าห้องใต้ดินข้างล่างนั้นไม่ได้ถูกออกแบบโดยอิงสุนทรียะใดๆ คล้ายว่าพวกเขาเองหากไร้เงินเสียอย่าง ก็เหมาะสมแค่กับห้องใต้ดินมืดๆ ทื่อๆ ข้างล่างนั้นนั่นแหละ และเงินเท่านั้นที่จะหยืบยื่นโอกาสในการนั่งเสพงานดีไซน์และสุนทรียะบนตัวบ้านได้ หรือไม่ก็ต้องอยู่อย่างปรสิตข้างใต้เพื่อจะแอบขึ้นมาลิ้มลองความสุนทรีย์เป็นบางครั้งคราว</Text>
                <Image source={{ uri: "https://themomentum.co/wp-content/uploads/2019/07/TheMO-Parasite_content01.jpg" }}
                    style={{ width: 450, height: 300, marginTop: 15 }} />

                <Text style={{ fontSize: 20, padding: 5, color: '#828282' }}>   และเมื่อการเข้ามาอยู่ของคนจนนั้นแนบเนียน ไม่มีร่องรอยให้สงสัย การปะทุแตกของเรื่องจึงเกิดขึ้นอย่างฉับพลันและชวนช็อกที่สุด ครอบครัวปาร์กที่ไม่เคยรู้อะไรมาก่อนเลย เมื่อถึงวันเกิดเหตุทุกอย่างกลับระเบิดแรง หลังจากวันนั้นพวกเขาที่เหลือคงได้แต่ถามตัวเองว่าทำไม หรือตัวเองทำผิดอะไรจึงต้องมาเจอเรื่องแบบนี้ และหากพวกเขาจะโกรธควรจะโกรธใครก่อนดี

                    เรื่องของความโกรธจึงเป็นอีกหนึ่งประเด็นสำคัญที่ผู้เขียนรู้สึกถึง ความโกรธเกรี้ยวของพ่อผู้เป็นคนจน ผู้ที่วางแผนอะไรก็ไม่เคยเป็นไปตามแผน ระเบิดออกด้วยการประหารชีวิตคุณปาร์ก มันเป็นอารมณ์ชั่ววูบที่เขาไม่รู้แน่ชัดด้วยซ้ำว่าทำไปทำไม ความโกรธของสามีคนจนอีกคนที่จับจองฐานะปรสิตใต้ดินมาก่อน ระเบิดออกด้วยการขึ้นมาฆ่าล้างบางพวกที่มาทำลายวิถีปรสิตอันสงบสุขของเขา

                    Parasite ฉายภาพสังคมเกาหลีใต้ที่ระบบทุนนิยมและความเหลื่อมล้ำได้ฝังรากลึกจนยากจะบอกว่าทั้งหมดที่เกิดขึ้นเป็นความผิดของใครกันแน่ มันอาจจะเริ่มมาตั้งแต่สมัยโชซอน สมัยสงครามโลก และกลืนกินประเทศมาจนถึงปัจจุบัน ซึ่งนั่นยิ่งทำให้ความโกรธเกรี้ยวของผู้คนยิ่งเคว้งคว้างว่างเปล่า เราควรจะโกรธใครดี นักการเมืองสักคนไหม นายทุนสักคนหรือเปล่า หรือพวกคนจนฉ้อฉลที่เอาแต่อ้างความจนมาเอาเปรียบคนอื่น? มันคงน่าโกรธยิ่งกว่าเมื่อเราไม่อาจรู้ว่าควรเอาความโกรธไปลงที่ใครหรืออะไร ทุกอย่างมันส่งผลต่อกันจนทุกคนมีส่วนเกี่ยวข้องกับความบิดเบี้ยวของสังคมนี้ไปหมด เราอาจโกรธระบบ แต่ถามว่าจะโค่นล้มมันลงอย่างไร เราก็คงตอบไม่ได้ ดีไม่ดีก็คงจบลงที่การศิโรราบต่อทุนนิยมเหมือนที่คีวูฝันจะทำ

                    ความโกรธเกรี้ยวชอนไชอยู่ในทุกอณูของหนังโดยเฉพาะช่วงท้ายเรื่อง ซึ่งสิ่งนี้เองที่อาจเป็นปรสิตสำหรับประเทศเกาหลีใต้ ดูจบแล้วก็ทำให้นึกถึงบทสัมภาษณ์ของผู้กำกับสารคดีชาวเกาหลี ชองยุนซอก ที่บอกว่าเขาทำสารคดีที่เล่าถึงความไม่ยุติธรรมของโทษประหารเพราะเขาโกรธ ขณะที่คนไทยโกรธไม่พอ เราโกรธกันอย่างมากก็โพสต์ด่าในโซเชียลมีเดีย เราโกรธกันอยู่ในวงแคบๆ โกรธกันเป็นวาระ แต่มันยังไม่มากพอที่จะระเบิดออกมาแรงๆ

                    ยังไม่ต้องพูดถึงภาวะเผด็จการเรื้อรังหรือข้อกฎหมายที่ไม่เป็นธรรมทั้งหลาย ว่ากันที่เรื่องความเหลื่อมล้ำเรื่องเดียวก่อน เราคนไทยยังต้องไปอินนักหนากับหนังความเหลื่อมล้ำที่มาจากความโกรธของคนเกาหลีใต้ ทั้งที่จริงแล้วเกาหลีใต้ไม่ใช่ประเทศที่ความเหลื่อมล้ำสูงที่สุดในโลกด้วยซ้ำ</Text>

            </View>
        </ScrollView>

    );
}