import React from 'react';
import { View, Text, Image, ScrollView, FlatList } from 'react-native';
import { FontAwesome } from '@expo/vector-icons';
import { createMaterialTopTabNavigator } from '@react-navigation/material-top-tabs';

const Tab = createMaterialTopTabNavigator();

export default function TrainToBusanTab() {

    return (
        <Tab.Navigator screenOptions={{ tabBarActiveTintColor: "tomato", tabBarInactiveTintColor: "gray", }} >
            <Tab.Screen
                name="FlashScreen"
                component={FlashScreen}
                options={{
                    tabBarLabel: "Short Story",
                    headerShown: false
                }}
            />
            <Tab.Screen
                name="FlameScreen"
                component={FlameScreen}
                options={{
                    tabBarLabel: "Characters",
                    headerShown: false
                }}
            />
            <Tab.Screen
                name="LeafScreen"
                component={LeafScreen}
                options={{
                    tabBarLabel: "Others",
                    headerShown: false
                }}
            />

        </Tab.Navigator>


    );

}
function FlashScreen() {
    return (
        <ScrollView contentContainerStyle={{ flexGrow: 1, alignItems: 'center' }}>
            <View style={{ flex: 1, alignItems: 'center' }}>
                <Image
                    source={{ uri: "https://i.pinimg.com/564x/40/6b/30/406b30073f5032c813659f2f1872309e.jpg" }}
                    style={{ width: 450, height: 280 }}
                />
                <View style={{ flexDirection: 'row', margin: 8 }}>
                    <Image
                        source={{ uri: "https://i.makeagif.com/media/1-28-2017/8dxYB1.gif" }}
                        style={{ width: 220, height: 160, marginRight: 5 }}
                    />
                    <Image
                        source={{ uri: "https://i.pinimg.com/originals/87/3a/c1/873ac1ba7f3cb7a2b46a0321f41ce71d.gif" }}
                        style={{ width: 210, height: 160, marginLeft: 5 }}
                    />

                </View>

                <Text style={{ fontSize: 30, paddingTop: 20 }}>Train To Busan</Text>
                <Text style={{ fontSize: 17, padding: 10, color: '#828282' }}>   ซอกวู เป็นผู้จัดการกองทุนที่มุ่งกอบโกยผลประโยชน์ส่วนตนเป็นสำคัญ และไม่มีเวลาให้ครอบครัว เขาอาศัยอยู่ในโซลกับลูกสาวชื่อซอซูอัน และคุณย่า ในวันเกิดของซูอัน เธอขอร้องให้ซอกวูพาไปหาแม่ที่เมืองปูซาน ซึ่งเป็นเวลาเดียวกันกับที่เชื้อโรคประหลาดได้แพร่ไปทั่วเมือง และบนรถไฟขบวนที่สองพ่อลูกนั่งไปก็มีหญิงสาวติดเชื้อลอบขึ้นไปด้วย เพียงไม่นาน ผู้คนบนรถไฟต่างก็รับรู้ข่าวการแพร่ระบาดของเชื้อโรคจนเกิดความวุ่นวายขึ้นทุกหนแห่ง สถานการณ์เลวร้ายลงเมื่อหญิงสาวที่แอบขึ้นมาบนขบวนรถไฟกลายเป็นซอมบี้ไล่ล่าผู้โดยสาร แม้รถไฟจะยุติการเดินทางที่เมืองแทจอน แต่เมื่อลงจากรถไฟทุกคนกลับพบว่าเมืองทั้งเมืองเต็มไปด้วยฝูงซอมบี้ ผู้โดยสารที่เหลือรอดจึงจำใจต้องเดินทางต่อไป ซอกวูที่พยายามช่วยเหลือแต่ตัวเองและลูกสาว กลับต้องมาร่วมมือกับคนอื่นๆ เพื่อเอาชีวิตรอด เขาได้เห็นเบื้องลึกของมนุษย์ที่แสดงออกมาในภาวะคับขัน ได้เห็นความสูญเสีย ความรัก ความเห็นแก่ตัว การเอาตัวรอด รวมถึงความบริสุทธิ์ของซูอัน ซึ่งผลักดันให้เขายอมแลก แม้กระทั่งสิ่งที่สำคัญที่สุดไป นั่นคือ ชีวิตของเขาเอง</Text>

            </View>
        </ScrollView >
    );
}

function FlameScreen(props) {
    return (
        <ScrollView >
            <View style={{ alignItems: 'center', justifyContent: 'center' }}>
                <View style={{ flexDirection: 'row', marginTop: 20, margin: 15, height: 50, width: 242, borderRadius: 15, paddingHorizontal: 10, backgroundColor: '#787878', opacity: 1, borderWidth: 1, borderColor: 'white' }}>
                    <Text style={{ fontSize: 35 }}>รายชื่อตัวละคร </Text>
                </View>

                <View style={{ alignItems: 'center' }}>
                    <Image source={{ uri: "https://i.pinimg.com/564x/bf/21/0d/bf210d9d4bbc5107794878aa8c78ddbe.jpg" }}
                        style={{ width: 350, height: 400, borderRadius: 20, marginTop: 15 }} />
                    <Text style={{ fontSize: 25, paddingTop: 10 }}>ซอกวู</Text>

                    <Image source={{ uri: "https://i.pinimg.com/564x/d0/2e/26/d02e261b5a9ddb02d20f7145d3841f5d.jpg" }}
                        style={{ width: 350, height: 360, borderRadius: 20 ,marginTop:15}} />
                    <Text style={{ fontSize: 25, paddingTop: 10 }}>ลูกสาวของซอกวู</Text>


                    <Image source={{ uri: "https://i.pinimg.com/564x/0b/c5/65/0bc56535a061e03a2c84b4281a38d007.jpg" }}
                        style={{ width: 350, height: 360, borderRadius: 20, marginTop: 15 }} />
                    <Text style={{ fontSize: 25, paddingTop: 10 }}>ยุน ซัง-ฮวา</Text>

                    <Image source={{ uri: "https://f.ptcdn.info/251/048/000/oiw6fj9hrbM54U2m2Ea-o.jpg" }}
                        style={{ width: 350, height: 440, borderRadius: 20, marginTop: 15 }} />
                    <Text style={{ fontSize: 25, paddingTop: 10 }}>ซองคย็อง ภรรยาของซังฮวา</Text>
                </View>
            </View>
        </ScrollView >
    );
}


function LeafScreen() {
    return (
        <ScrollView>


            <View style={{ alignItems: 'center', justifyContent: 'center' }}>
                <Text style={{ padding: 15, fontSize: 28 }}>6 ประโยคตรึงใจ ระหว่างทาง Train to Busan ที่ตั้งคำถามว่า เราอยากเป็นผู้ใหญ่แบบไหนในสายตาเด็กๆ</Text>
            </View>

            <View>
                <Image source={{ uri: "https://thestandard.co/wp-content/uploads/2020/07/POP_QUOTE_FB.jpg" }}
                    style={{ width: 450, height: 430, marginTop: 15 }} />
                <Text style={{ fontSize: 20, padding: 5, color: '#828282' }}>   ประโยคเตือนสติจากผู้เป็นแม่ ที่สะท้อนให้เห็นว่าแม้ว่าภายนอก ซอกวู (กงยู) จะเป็นคนหนุ่มอนาคตไกลที่ขยันขันแข็งจนประสบความสำเร็จในหน้าที่การงาน เป็นแบบอย่างที่ใครอีกหลายคนอยากจะเป็น แต่หากมองในฐานะพ่อ แทบจะเรียกได้ว่าเขาล้มเหลวโดยสิ้นเชิง
                    มีความสามารถ ขยันขันแข็ง รู้เหลี่ยมคมในการทำธุรกิจ มีความรับผิดชอบต่อหน้าที่ของตนเอง คือหัวใจสำคัญที่ทำให้คนเราประสบความสำเร็จได้ หากแต่การเอาชนะหัวใจของคนเป็นลูก มันอาจไม่จำเป็นต้องมีความสามารถ มีไหวพริบ ขยันขันแข็ง หรือซื้อของเล่นราคาแพง (ที่จำไม่ได้ด้วยซ้ำว่าเคยซื้อให้ลูกไปแล้ว) มาให้
                    คำตอบอาจอยู่ที่เคล็ดลับสั้นๆ ง่ายๆ คือ ‘ความใส่ใจ’ และมีเวลาดูแลหัวใจดวงน้อยๆ ให้มากขึ้นเท่านั้นเอง
                   </Text>

                <Image source={{ uri: "https://thestandard.co/wp-content/uploads/2020/07/POP_QUOTE_FB-copy.jpg" }}
                    style={{ width: 450, height: 430, marginTop: 15 }} />
                <Text style={{ fontSize: 20, padding: 5, color: '#828282' }}>   เมื่อหนูน้อย ซูอา (คิมซูอัน) บังเอิญมาพบนักธุรกิจ (คิมอึยซอง) ในช่วงที่เจ้าหน้าที่รถไฟกำลังขับไล่คนจรจัดที่แอบหนีขึ้นมาในรถ ก่อนที่นักธุรกิจจะสั่งสอน ‘บทเรียน’ ที่คิดว่า ‘ถูกต้อง’ ที่สุดให้กับซูอา
                    “นี่หนู ถ้าไม่ตั้งใจเรียนเดี๋ยวจะเป็นเหมือนเขานะรู้ไหม”
                    แม้ว่าถ้าฟังเผินๆ ประโยคที่ใครหลายคนเคยได้ยินในวัยเด็กประโยคนี้ จะมีที่มาจาก ‘ความหวังดี’ อยู่บ้าง แต่ถ้ามองให้ลึกไปกว่านั้น นี่คือประโยคที่ค่อยๆ ปลูกฝังให้เด็กตีตรา ‘คุณค่า’ ของคนคนหนึ่งด้วยสถานะทางสังคม อาชีพการงาน หรือแม้แต่ภาพลักษณ์ภายนอกของคนอื่น สิ่งเหล่านี้อาจเป็นการปลูกฝังเมล็ดพันธุ์แห่ง ‘การดูถูกเหยียดหยาม’ ให้กับพวกเขา
                    สุดท้ายแล้ว ที่เด็กๆ อยากตั้งใจเรียน อาจไม่ใช่เพราะกลัวว่าจะเติบโตไปเป็นคนจรจัด แต่กลัวว่าจะเติบโตไปเป็นผู้ใหญ่ที่เต็มไปด้วยถ้อยคำดูถูกเหยียดหยามคนอื่นก็ได้</Text>

                <Image source={{ uri: "https://thestandard.co/wp-content/uploads/2020/07/POP_QUOTE_FB-copy-2.jpg" }}
                    style={{ width: 450, height: 430, marginTop: 15 }} />
                <Text style={{ fontSize: 20, padding: 5, color: '#828282' }}>   บทเรียนสำคัญ และเป็นบทเรียนสุดท้ายที่คนเป็นพ่ออย่าง ซอกวู ได้ ‘เรียนรู้’ จากลูกสาวของตัวเอง
                    ในระหว่างที่ซอกวูพยายามทำทุกอย่างเพื่อปกป้องลูกสาว จนไม่สนใจว่าคนอื่นจะเป็นอย่างไร เขาพยายามทำหน้าที่ของคนเป็น ‘พ่อ’ ให้ดีที่สุด เท่าที่คนเคยแต่ทำงานเพื่อหากำไรสูงสุดอย่างเขาจะทำได้
                    ถึงแม้ถ้าทำตามนั้นทั้งคู่อาจปลอดภัย แต่สิ่งที่ซูอารู้สึกได้ คือความน่ารังเกียจในฐานะ ‘มนุษย์’ ที่เป็นห่วงแต่ตัวเองจนไม่สนใจว่าคนรอบข้างจะเป็นอย่างไร ซึ่งอาจเป็นความรู้สึกเดียวกับที่ภรรยาตัดสินใจทิ้งซอกวูไปเช่นกัน</Text>

                <Image source={{ uri: "https://thestandard.co/wp-content/uploads/2020/07/POP_QUOTE_FB-copy-3.jpg" }}
                    style={{ width: 450, height: 430, marginTop: 15 }} />
                <Text style={{ fontSize: 20, padding: 5, color: '#828282' }}>   ซังฮวา (มาดงซอก) คุณพ่อป้ายแดงคนนี้ คือหนึ่งในตัวละครจาก Train to Busan ที่ผู้ชมทั้งรัก ประทับใจ และเชื่อใจว่าหลายคนต้องเสียน้ำตาให้กับประโยคสั้นๆ นี้อย่างแน่นอน 
                ซังฮวาคือตัวละครขั้วตรงข้ามของซอกวู ที่พยายามช่วยเหลือคนอื่น แม้สถานการณ์จะคับขัน และภรรยาของตัวเองกำลังตั้งท้อง และก่อนที่ซังฮวาจะยอมเสียสละตัวเองเพื่อช่วยให้ภรรยาของเขาและคนอื่นๆ หนีเอาตัวรอด เขาก็ได้ทำหน้าที่ของพ่อที่แม้จะยังไม่เคยเจอหน้าเป็นครั้งสุดท้าย ด้วยการมอบสิ่งที่จะอยู่ติดตัวกับเด็กน้อยคนนี้ไปตลอดกาล
                “ยุนซูยอน นั่นคือชื่อลูกของเรา”
                ยุนซูยอน จึงไม่ได้เป็นเพียง ‘ชื่อ’ ที่เขาตั้งให้กับลูกก่อนจะจากไปเท่านั้น แต่ยังหมายถึง ตัวตน ของเขาจะคงอยู่ภายในชื่อที่จะติดตัวลูกของเขา เพื่อคุ้มครองและดูแลลูกของตัวเองตลอดไป</Text>

                <Image source={{ uri: "https://thestandard.co/wp-content/uploads/2020/07/POP_QUOTE_FB-copy-4.jpg" }}
                    style={{ width: 450, height: 430, marginTop: 15 }} />
                <Text style={{ fontSize: 20, padding: 5, color: '#828282' }}>   อีกหนึ่งฉากสุดสะเทือนใจที่ทำให้ผู้ชมทั้งโศกเศร้าและเจ็บปวด เมื่อกลุ่มของซอกวูสามารถช่วยเหลือ อินกิล (เยซูจุง) พี่สาวของ ยองกิล (พัคมยอนชิน) มาได้สำเร็จ แต่กลุ่มผู้รอดชีวิตกลับพยายามขวางไม่ให้พวกซอกวูเข้ามาในโบกี้ได้ เพราะกลัวว่าพวกซอกวูจะติดเชื้อมาด้วย จึงทำให้อินกิลถูกซอมบี้เข้าทำร้ายในที่สุด
                    “ยัยโง่เอ้ย ชอบทำดี ชอบช่วยเหลือคนอื่น คิดถึงคนอื่นก่อนตัวเองเสมอ ทำไมเธอถึงได้ชอบเป็นแบบนั้น โง่ชะมัดเลย”
                    แม้จะเป็นคำพูดประชดประชัน แต่ยิ่งฟังมันก็ยิ่งเจ็บปวด เพราะหากอินกิลเห็นแก่ตัวและพยายามเอาตัวรอด เธอก็คงจะเป็นหนึ่งในผู้รอดชีวิต แต่เธอกลับยอมให้คนอื่นๆ หนีไปก่อนตนเอง และจากลาน้องสาวด้วยรอยยิ้มที่ยังคงตราตรึงผู้ชมจนถึงทุกวันนี้
                    เมื่อรอยยิ้มสุดท้ายจางหายไป เราได้แต่หวังลึกๆ ว่าในโลกความจริง คนที่ชอบทำดี ชอบช่วยเหลือคนอื่น อย่างอินกิลจะไม่กลายเป็น ‘คนโง่’ อย่างที่ยองกิลได้กล่าวไว้จริงๆ  
                </Text>

                <Image source={{ uri: "https://thestandard.co/wp-content/uploads/2020/07/POP_QUOTE_FB-copy-5.jpg" }}
                    style={{ width: 450, height: 430, marginTop: 15 }} />
                <Text style={{ fontSize: 20, padding: 5, color: '#828282' }}>   หลังจากที่ผู้ชมได้ติดตามเรื่องราวการเอาชีวิตรอด และการเรียนรู้เพื่อเป็นพ่อที่ดีขึ้นของซอกวู ซึ่งเคยเป็นคนเห็นประโยชน์ส่วนตัวมากกว่าสิ่งใด แต่ในท้ายที่สุดเหตุการณ์ต่างๆ ก็ค่อยๆ ทำให้เขากลายเป็นคนที่ดีขึ้น จนวาระสุดท้ายที่คุณพ่อผู้ล้มเหลวสามารถมอบบทเรียนสำคัญ ที่จำเป็นต่อการมีชีวิตอยู่ต่อไป นั่นคือการสอนให้ลูกสาวรู้จักกับคำว่า ‘ความกลัว’
                    “กลัวสิ พ่อก็กลัว”
                    ในเวลาที่เขาควรจะทำตัวเข้มแข็งเพื่อให้กำลังใจซูอันที่กำลังหวาดกลัวกับเหตุการณ์ที่ถาโถมเข้ามา แต่ซอกวูกลับเลือกที่จะไม่ปิดบังและแสดงความรู้สึก ‘กลัว’ เพื่อแสดงให้ลูกสาวของเขาได้เห็นว่า บางครั้งการที่เรายอมรับว่าเรากลัวก็ไม่ใช่เรื่องที่ผิดเสมอไป
                    เมื่อรับรู้ว่ากลัว เราจึงเข้มแข็ง เมื่อเข้มแข็ง เราจึงสามารถใช้ชีวิตได้อย่างสง่างาม</Text>
            </View>
        </ScrollView>

    );
}