import React from 'react';
import { View, Text, Image, ScrollView, FlatList } from 'react-native';
import { FontAwesome } from '@expo/vector-icons';
import { createMaterialTopTabNavigator } from '@react-navigation/material-top-tabs';

const Tab = createMaterialTopTabNavigator();

export default function TwentyfiveTwentyoneTab() {

    return (
        <Tab.Navigator screenOptions={{ tabBarActiveTintColor: "tomato", tabBarInactiveTintColor: "gray", }} >
            <Tab.Screen
                name="FlashScreen"
                component={FlashScreen}
                options={{
                    tabBarLabel: "Short Story",
                    headerShown: false
                }}
            />
            <Tab.Screen
                name="FlameScreen"
                component={FlameScreen}
                options={{
                    tabBarLabel: "Characters",
                    headerShown: false
                }}
            />
            <Tab.Screen
                name="LeafScreen"
                component={LeafScreen}
                options={{
                    tabBarLabel: "Others",
                    headerShown: false
                }}
            />

        </Tab.Navigator>


    );

}
function FlashScreen() {
    return (
        <ScrollView contentContainerStyle={{ flexGrow: 1, alignItems: 'center' }}>
            <View style={{ flex: 1, alignItems: 'center' }}>
                <Image
                    source={{ uri: "https://i.pinimg.com/564x/c1/fe/be/c1febe2d1639f7359472a15ac4659623.jpg" }}
                    style={{ width: 450, height: 330}}
                />
                <View style={{ flexDirection: 'row', margin: 8 }}>
                    <Image
                        source={{ uri: "https://i.pinimg.com/originals/31/97/89/319789d717f9d9e387c5f9b6981a8063.gif" }}
                        style={{ width: 220, height: 160, marginRight: 5 }}
                    />
                    <Image
                        source={{ uri: "https://64.media.tumblr.com/ce206ad945123cac2cb8c2cd6d4df818/675ecd338e4368ff-90/s540x810/839f73091596aa72961d0f70f4b2fcc821894588.gifv" }}
                        style={{ width: 210, height: 160, marginLeft: 5 }}
                    />

                </View>

                <Text style={{ fontSize: 30, paddingTop: 20 }}>Twenty five Twenty one </Text>
                <Text style={{ fontSize: 17, padding: 10, color: '#828282' }}>   วิกฤตไอเอ็มเอฟในปี 1998 ได้ส่งผลกระทบต่อโรงเรียนมัธยมปลายหญิงซอนจุง ทำให้ถูกตัดงบประมาณ ชมรมกีฬาฟันดาบที่ไม่มีผลงานจึงต้องถูกยุบไปด้วย มันได้ทำลายความฝันของนา ฮี-โด (คิม แท-รี) นักเรียนชั้น ม. ปลาย และนักกีฬาฟันดาบ ที่มีเป้าหมายชีวิตอันยิ่งใหญ่ และได้มาพบกับแพ็ค อี-จิน (นัม จู-ฮย็อก) ชายหนุ่มที่มีความขยันหมั่นเพียร เนื่องจากครอบครัวก็ได้รับผลกระทบและประสบปัญหาอย่างหนักจากวิกฤตไอเอ็มเอฟ แพ็ค อี-จินจึงต้องแบกรับความรับผิดชอบต่อครอบครัวในฐานะลูกชายคนโต และเดินตามความใฝ่ฝันจนได้กลายมาเป็นผู้ประกาศข่าวในที่สุด</Text>

            </View>
        </ScrollView >
    );
}

function FlameScreen(props) {
    return (
        <ScrollView >
            <View style={{ alignItems: 'center', justifyContent: 'center' }}>
                <View style={{ flexDirection: 'row', marginTop: 20, margin: 15, height: 50, width: 242, borderRadius: 15, paddingHorizontal: 10, backgroundColor: '#D7A35D', opacity: 1, borderWidth: 1, borderColor: 'white' }}>
                    <Text style={{ fontSize: 35 }}>รายชื่อตัวละคร </Text>
                </View>

                <Text style={{ padding: 15, fontSize: 28 }}>นักแสดงนำ</Text>
                <View style={{ alignItems: 'center' }}>
                    <Image source={{ uri: "https://i.pinimg.com/736x/42/47/c3/4247c39d5490f1699254d8d7ecf59785.jpg" }}
                        style={{ width: 350, height: 350, borderRadius: 20, marginTop: 15 }} />
                    <Text style={{ fontSize: 25, paddingTop: 10 }}>นา ฮี-โด</Text>

                    <Image source={{ uri: "https://i.pinimg.com/564x/a1/2c/8b/a12c8b96e5e2713d34d0d510d4f35955.jpg" }}
                        style={{ width: 350, height: 350, borderRadius: 20 }} />

                    <Text style={{ fontSize: 25, paddingTop: 10 }}>แพ็ค อี-จิน</Text>

                    <Image source={{ uri: "https://i.pinimg.com/736x/74/0b/8b/740b8b04cef52aebf5d9757aa98d6bdb.jpg" }}
                        style={{ width: 350, height: 350, borderRadius: 20, marginTop: 15 }} />

                    <Text style={{ fontSize: 25, paddingTop: 10 }}>โก ยู-ริม</Text>

                    <Image source={{ uri: "https://i.pinimg.com/564x/f5/8e/67/f58e67355262af3eaeffb968d29b161c.jpg" }}
                        style={{ width: 350, height:350, borderRadius: 20, marginTop: 15 }} />

                    <Text style={{ fontSize: 25, paddingTop: 10 }}>มุน จี-อุง</Text>


                    <Image source={{ uri: "https://i.pinimg.com/736x/ab/83/aa/ab83aa33ad7d14d3c85d3ee904e35345.jpg" }}
                        style={{ width: 350, height: 350, borderRadius: 20, marginTop: 15 }} />
                    <Text style={{ fontSize: 25, paddingTop: 10 }}>จี ซึง-วาน</Text>

                </View>
            </View>
        </ScrollView >
    );
}


function LeafScreen() {
    return (
        <ScrollView>


            <View style={{ alignItems: 'center', justifyContent: 'center' }}>
                <Text style={{ padding: 15, fontSize: 28 }}>Twenty five Twenty one กับ 13 ประโยคที่จะทำให้คุณได้รับแรงบัลดาลใจในการใช้ชีวิต</Text>
            </View>

            <View>

                <Text style={{ fontSize: 25, padding: 10 }}>1.การปกป้องความฝันน่ะ แม้แผนการของเธอจะผิด แต่ความตั้งใจของเธอถูกต้องแล้ว</Text>
                <Text style={{ fontSize: 20, padding: 5, color: '#828282' }}>   การที่นาฮีโดอยากจะย้ายโรงเรียนเพราะจะได้ไปอยู่ชมรมฟันดาบ ทำให้เธอคิดแผนการมากมายเพื่อที่จะทำให้โรงเรียนไล่ออก หรือ สั่งย้าย และก็มาถึงความคิดสุดประหลาด อย่างการเข้าไปในไนต์คลับเพื่อที่จะทำให้ตัวเองถูกตำรวจจับเพราะอายุไม่ถึง แต่เธอก็ได้ไปเจอกับแพคอีจินและเขาก็ลากเธอออกจากที่นั้น พร้อมกับต่อว่าและเตือนสติเธอ เพราะสิ่งที่เธอทำมันไม่ใช่วิธีที่ถูกต้องเลย</Text>

                <Image source={{ uri: "https://i.pinimg.com/564x/d0/cc/f2/d0ccf2ea12ef19feec9a6816c1d9ee6e.jpg" }}
                    style={{ width: 450, height:290, marginTop: 15 }} />

                <Text style={{ fontSize: 25, padding: 10 }}>2.ผมเพิ่งมาแถวนี้ครั้งแรก แถมส่งหนังสือพิมพ์ครั้งแรก ทุกคนต่างก็ต้องมีครั้งแรกนี่ครับ ครั้งแรกของผมคือวันนี้ ฉะนั้น ผมจะเงอะงะแค่วันนี้ครับ ตั้งแต่พรุ่งนี้จะไม่มาสายแล้วครับ</Text>
                <Text style={{ fontSize: 20, padding: 5, color: '#828282' }}>   เป็นสถานการณ์ที่แพคอีจินไปส่งหนังสือพิมพ์ในย่านที่ไม่คุ้นเคย ทำให้เขาไปส่งล่าช้าจนมีคุณลุงคนหนึ่งออกมาโวยวาย เขาจึงอธิบายว่านี่เป็นครั้งแรกที่มาส่งหนังสือพิมพ์ที่นี้ ทำให้ยังไม่ชินกับเส้นทางจนเกิดความล่าช้า แต่เขารับรองว่านี้จะเป็นครั้งแรกและครั้งเดียวที่เขาจะทำผิดพลาด เพราะหลังจากเขาชินเส้นทาง เขาจะมาส่งหนังสือพิมพ์ตามเวลาอย่างแน่นอน ประโยคที่แพคอีจินกล่าวข้างต้น เป็นสิ่งที่ยืนยันว่าทุกคนต้องมีครั้งแรกในการทำสิ่งใหม่ ๆ เสมอ และถ้าสิ่งที่ทำมันออกมาไม่ดี ก็แค่เรียนรู้และหาวิธีที่จะปรับปรุง</Text>

                <Text style={{ fontSize: 25, padding: 10 }}>3.หนูมีพรสวรรค์ในการฟันดาบนะ เพราะแบบนั้นหนูถึงได้เริ่ม ถึงตอนนี้จะอยู่ในช่วงตกต่ำ แต่หนูจะผ่านมันไปได้ และหนูก็ไม่ต้องการอะไรทั้งนั้น หนูแค่ชอบการฟันดาบ</Text>
                <Text style={{ fontSize: 20, padding: 5, color: '#828282' }}>   ในขณะที่หลายคนไม่เชื่อมั่นหรือไม่สนับสนุนในความฝันของเธา แต่นาฮีโดยังคงมั่นใจอย่างมากที่จะสู้เพื่อความฝันของตัวเอง ถ้าคุณอายุยังน้อยแล้วมีความฝัน อย่าละทิ้งความฝันของตัวเองและโอนอ่อนต่อคำพูดของคนอื่นง่าย ๆ เพราะถ้าคุณล้มเลิกความฝันเมื่อเวลาผ่านไปจนก้าวไปสู่วัยผู้ใหญ่ คุณจะรู้สึกเสียดายช่วงเวลาเหล่านั้นมาก ถ้าอายุยังน้อยเดินตามความฝันของคุณไปให้สุดทาง พยายาม ทุ่มเทให้สุดความสามารถ ถ้ามันจะไม่สำเร็จจริง ๆ ช่วงเวลาที่ยากลำบากทั้งหมดที่ผ่านมาก็จะยังเป็นความทรงจำที่สวยงามในจิตใจเสมอ</Text>

                <Image source={{ uri: "https://i.pinimg.com/564x/6f/1c/77/6f1c7710aa0666a5d8edf0c7353e30be.jpg" }}
                    style={{ width: 450, height: 400, marginTop: 15 }} />

                <Text style={{ fontSize: 25, padding: 10 }}>4.ยุคสมัยบีบให้เรายอมทิ้งทุกอย่างแล้ว จะยอมทิ้งความสุขไปด้วยได้ไง</Text>
                <Text style={{ fontSize: 20, padding: 5, color: '#828282' }}>   เป็นคำพูดที่นาฮีโดใช้ดึงสติของแพคอีจิน ในช่วงเวลาที่เขาเจอเรื่องราวที่ลำบากใจและเจ็บปวด เธอได้ยืนข้างเขาและให้ถ้อยคำปลอบโยนจิตใจ และกล่าวบอกกับเขาให้เขาลองแอบมีความสุข เฉพาะเวลาที่อยู่กับเธอก็ได้ หาสิ่งเล็ก ๆ น้อย ๆ ทำให้เกิดรอยยิ้มและเสียงหัวเราะ อย่าให้ตัวเองต้องเจ็บปวดมากเกินไปเลย "เรามามีความสุขกันบ่อย ๆ นะ นายเลือกไม่ได้นายต้องทำ นายบอกคุณลุงพวกนั้นไว้ใช่ไหมว่าต่อไปนี้จะไม่ขอมีความสุขอีกไม่ว่าช่วงเวลาไหน ฉันขอค้านนะ" นาฮีโด</Text>


                <Text style={{ fontSize: 25, padding: 10 }}>5.เรื่องนี้ไม่เกี่ยวว่าเธอคิดยังไงกับฉันหรอก ไม่ว่าเธอจะทำอะไร ไม่ว่าเธอจะเป็นแบบไหน ฉันก็รักเธอในแบบที่เธอเป็น</Text>
                <Text style={{ fontSize: 20, padding: 5, color: '#828282' }}>   ประโยคนี้ของอีจินทัชใจอย่างมาก ความรักที่ไม่ได้คาดหวังอะไร ไม่ต้องการสิ่งใดตอบแทน ถือเป็นความรักที่หายากมาก การที่คน ๆ หนึ่งจะสนับสนุนทุกช่วงเวลาของเรา อีจินบอกให้ฮีโดทำทุกอย่างที่อยากทำได้เลย เขาก็แค่รักเธอและไม่ต้องการให้เธอมอบอะไรตอบแทน แค่จะยืนอยู่ในจุดที่เธอสามารถมองเห็นเขาไปตลอดเท่านั้นเอง</Text>

                <Text style={{ fontSize: 25, padding: 10 }}>6.นักกีฬาจำเป็นต้องลงแข่ง ไม่ว่าจะแพ้หรือชนะก็ต้องลงแข่งก่อน จะได้รู้สึกถึงพัฒนาการ จากนั้นก็จะได้ไปต่อ</Text>
                <Text style={{ fontSize: 20, padding: 5, color: '#828282' }}>   บางคนมุ่งแต่จะเอาชนะ แต่สำหรับฮีโดเธอคิดลึกซึ้งกว่านั้น แน่นอนว่าฮีโดมีความฝันว่าอยากเป็นที่ 1 แต่เธอก็ไม่ได้เป็นคนที่แพ้ไม่เป็น เธอจะใช้ทุกช่วงเวลาเพื่อพัฒนาตัวเองเสมอ ไม่ว่าจะแพ้หรือชนะเธอจะไม่ยอมถอดใจ</Text>

                <Image source={{ uri: "https://i.pinimg.com/564x/ba/67/a6/ba67a6d26167c26f505da2d5cd8adbd4.jpg" }}
                    style={{ width: 450, height: 290, marginTop: 15 }} />

                <Text style={{ fontSize: 25, padding: 10 }}>7.ไม่ว่านายจะอยู่ที่ไหน ฉันจะส่งแรงใจไปถึงนายให้ได้ ฉันจะไปหานายเองไว้เจอกันตอนนั้นนะ</Text>
                <Text style={{ fontSize: 20, padding: 5, color: '#828282' }}>   เมื่ออีจินรู้สึกอ่อนแอ เขาจะเข้าไปในตู้โทรศัพท์สาธารณะและฟังเสียงของฮีโดซ้ำไปซ้ำมา ทั้งสองทำงานหนักและพ่ายแพ้ในที่ต่าง ๆ แต่พวกเขายังคงเดินหน้าต่อไปด้วยความร่าเริงและความอบอุ่น แม้ไม่ได้เจอกันแต่ก็ยังคงคิดถึงกัน เข้าใจกัน และเป็นคนที่มีอิทธิพลต่อความรู้สึกของอีกคนเสมอ เป็นความรู้สึกที่ดีแต่ก็น่าหนักใจ</Text>

                <Text style={{ fontSize: 25, padding: 10 }}>8.ผมหวังว่าต่อให้เราล้มเหลว เราก็จะมีจิตใจที่เข้มแข็งมากพอ ที่จะลุกขึ้นมาใหม่นะครับ</Text>
                <Text style={{ fontSize: 20, padding: 5, color: '#828282' }}>   ประโยคนี้ของอีจินในตอนนั้นก็คงจะไปโดนใจนักเรียนในโรงเรียนหลาย ๆ คน ที่ทิ้งเวลาความสนุก การเล่นกับเพื่อน เพื่ออ่านหนังสือกันอย่างเอาเป็นเอาตาย และทุกคนก็อยากมีชีวิตที่ดีที่ประสบความสำเร็จ แต่ในชีวิตมันก็ไม่ได้ง่ายที่จะไม่มีใครล้มเหลวเลย ดังนั้นไม่ว่าอะไรจะเกิดขึ้นความเข้มแข็งจะพาให้ผ่านเรื่องราวต่าง ๆ ไปได้</Text>

                <Text style={{ fontSize: 25, padding: 10 }}>9.ผมว่าเรายังไม่เคยรู้จักโลกที่ไม่เป็นไรถึงแม้จะทำไม่ได้ หรือแม้ว่าจะล้มเหลว แต่ยังไงก็ทำให้เต็มที่เท่าที่ไหวกันเถอะครับ</Text>
                <Text style={{ fontSize: 20, padding: 5, color: '#828282' }}>   อีจินถูกขอจากฮีโดให้จัดรายการวิทยุที่ชมรมกระจายเสียงของโรงเรียน และประโยคนี้ของเขาก็ได้ออกอากาศในโรงเรียน ตอนที่นักเรียนทุกคนกำลังเตรียมตัวสอบอยู่ มันเป็นประโยคที่มีความหมายอย่างมาก เพราะไม่ค่อยจะมีใครบอกให้เราล้มเหลวได้เลยในชีวิตจริง มีแต่หวังที่จะให้ประสบความสำเร็จทั้งนั้น</Text>

                <Image source={{ uri: "https://i.pinimg.com/564x/a7/33/2e/a7332e0e2d3d1442e1d6431fc1d9435c.jpg" }}
                    style={{ width: 450, height: 350, marginTop: 15 }} />

                <Text style={{ fontSize: 25, padding: 10 }}>10.การคาดหวังให้ออกมาดีทั้งที่ไม่พยายาม น่าอายมากกว่าอีกไม่ใช่เหรอ</Text>
                <Text style={{ fontSize: 20, padding: 5, color: '#828282' }}>   ฮีโดเป็นตัวแทนของความพยายาม แม้เธอจะมีพรสวรรค์ด้วยก็ตาม แต่ตลอดเส้นทางเราจะเห็นเธอพยายามเพื่อความฝันของเธออย่างสุดความสามารถเสมอ ดังนั้นการคาดหวังต่อที่ 1 ของเธอจึงมีค่าและเป็นสิ่งที่เธอควรค่าที่จะได้มันมาครอบครอง</Text>

                <Text style={{ fontSize: 25, padding: 10 }}>11.อย่าขี้ขลาดไปเลยหรือต่อให้ขี้ขลาดก็อย่าให้โดนจับได้</Text>
                <Text style={{ fontSize: 20, padding: 5, color: '#828282' }}>   การที่ฮีโด ไม่มั่นใจ ทำให้โค้ชรู้สึกกังวลถึงขั้นต้องเตือนสติเธอ เพราะถ้าเธอไม่เชื่อว่าตัวเองจะทำได้ หรือไม่มั่นใจในฝีมือ ทุกอย่างก็จะแสดงออกมา และมันก็ไม่เป็นผลดีต่อเธอมาก ๆ ดังนั้นถ้าขี้ขลาดก็อย่าให้คู่แข่งจับได้ เธอต้องซ่อนมันไว้ให้ลึกที่สุด นี่คงเป็นสิ่งที่โค้ชต้องการเพื่อประโยชน์ของฮีโดเอง</Text>

                <Image source={{ uri: "https://i.pinimg.com/564x/91/98/d2/9198d25ce100f37268c3aa6cb8447746.jpg" }}
                    style={{ width: 450, height: 310, marginTop: 15 }} />

                <Text style={{ fontSize: 25, padding: 10 }}>12.ไเหตุผลที่เธอแพ้ เพราะเธอคิดว่าเธอจะแพ้ และฉันจับได้ว่าเธอคิดแบบนั้น</Text>
                <Text style={{ fontSize: 20, padding: 5, color: '#828282' }}>   โค้ชได้คุยกับฮีโด และสังเกตได้ว่าจิตใจของเธอไม่มั่นคง ดังนั้นการที่จิตใจไม่มั่นคง ไม่มีความเชื่อมั่นในตัวเองมันก็จะแสดงออกมาชัดเจนจนคู่แข่งสังเกตได้ และแน่นอนว่าสุดท้ายความพ่ายแพ้ก็จะต้องตกเป็นของฮีโด</Text>

                <Text style={{ fontSize: 25, padding: 10 }}>13.สิ่งที่ผมเชื่อว่าจะไม่มีทางเปลี่ยนไปในโลกนี้ คือ แรงโน้มถ่วงเท่านั้น</Text>
                <Text style={{ fontSize: 20, padding: 5, color: '#828282' }}>   ผมคิดว่าไม่มีอะไรวางใจได้ว่าจะไม่เปลี่ยนครับ เพราะฉะนั้นผมเลยเชื่อในแรงโน้มถ่วงเท่านั้น , พัคอีจิน

                    ใช่แล้ว ทุกสิ่งในโลกล้วนเปลี่ยนแปลงได้ตลอดเวลา ไม่ว่าจะเป็น ใจคน การกระทำ ธรรมชาติ ฯลฯ ทุกอย่างสามารถที่จะเปลี่ยนแปลงได้ตลอด ขึ้นอยู่กับว่าจะเปลี่ยนเมื่อไหร่เท่านั้นเอง แต่ทั้งหมดทั้งมวลโลกก็สร้างบางสิ่งบางอย่างที่เป็นข้อยกเว้นมา และสุดท้ายแล้ว นาฮีโด คือข้อยกเว้นของ แพคอีจิน</Text>

                <Image source={{ uri: "https://i.pinimg.com/564x/3a/15/a8/3a15a829b26eb0ec887b9be3c477da4e.jpg" }}
                    style={{ width: 450, height: 350, marginTop: 15 }} />

               
            </View>
        </ScrollView>

    );
}